{
  "version": "2.0",
  "service": "<p>Amazon DocumentDB API documentation</p>",
  "operations": {
    "AddTagsToResource": "<p>Adds metadata tags to an Amazon DocumentDB resource. You can use these tags with cost allocation reporting to track costs that are associated with Amazon DocumentDB resources. or in a <code>Condition</code> statement in an AWS Identity and Access Management (IAM) policy for Amazon DocumentDB.</p>",
    "ApplyPendingMaintenanceAction": "<p>Applies a pending maintenance action to a resource (for example, to a DB instance).</p>",
    "CopyDBClusterParameterGroup": "<p>Copies the specified DB cluster parameter group.</p>",
    "CopyDBClusterSnapshot": "<p>Copies a snapshot of a DB cluster.</p> <p>To copy a DB cluster snapshot from a shared manual DB cluster snapshot, <code>SourceDBClusterSnapshotIdentifier</code> must be the Amazon Resource Name (ARN) of the shared DB cluster snapshot.</p> <p>To cancel the copy operation after it is in progress, delete the target DB cluster snapshot identified by <code>TargetDBClusterSnapshotIdentifier</code> while that DB cluster snapshot is in the <i>copying</i> status.</p>",
    "CreateDBCluster": "<p>Creates a new Amazon DocumentDB DB cluster.</p>",
    "CreateDBClusterParameterGroup": "<p>Creates a new DB cluster parameter group.</p> <p>Parameters in a DB cluster parameter group apply to all of the instances in a DB cluster.</p> <p>A DB cluster parameter group is initially created with the default parameters for the database engine used by instances in the DB cluster. To provide custom values for any of the parameters, you must modify the group after you create it. After you create a DB cluster parameter group, you must associate it with your DB cluster. For the new DB cluster parameter group and associated settings to take effect, you must then reboot the DB instances in the DB cluster without failover.</p> <important> <p>After you create a DB cluster parameter group, you should wait at least 5 minutes before creating your first DB cluster that uses that DB cluster parameter group as the default parameter group. This allows Amazon DocumentDB to fully complete the create action before the DB cluster parameter group is used as the default for a new DB cluster. This step is especially important for parameters that are critical when creating the default database for a DB cluster, such as the character set for the default database defined by the <code>character_set_database</code> parameter.</p> </important>",
    "CreateDBClusterSnapshot": "<p>Creates a snapshot of a DB cluster. </p>",
    "CreateDBInstance": "<p>Creates a new DB instance.</p>",
    "CreateDBSubnetGroup": "<p>Creates a new DB subnet group. DB subnet groups must contain at least one subnet in at least two Availability Zones in the AWS Region.</p>",
    "DeleteDBCluster": "<p>Deletes a previously provisioned DB cluster. When you delete a DB cluster, all automated backups for that DB cluster are deleted and can't be recovered. Manual DB cluster snapshots of the specified DB cluster are not deleted.</p> <p/>",
    "DeleteDBClusterParameterGroup": "<p>Deletes a specified DB cluster parameter group. The DB cluster parameter group to be deleted can't be associated with any DB clusters.</p>",
    "DeleteDBClusterSnapshot": "<p>Deletes a DB cluster snapshot. If the snapshot is being copied, the copy operation is terminated.</p> <note> <p>The DB cluster snapshot must be in the <code>available</code> state to be deleted.</p> </note>",
    "DeleteDBInstance": "<p>Deletes a previously provisioned DB instance. </p>",
    "DeleteDBSubnetGroup": "<p>Deletes a DB subnet group.</p> <note> <p>The specified database subnet group must not be associated with any DB instances.</p> </note>",
    "DescribeCertificates": "<p>Returns a list of certificate authority (CA) certificates provided by Amazon RDS for this AWS account.</p>",
    "DescribeDBClusterParameterGroups": "<p>Returns a list of <code>DBClusterParameterGroup</code> descriptions. If a <code>DBClusterParameterGroupName</code> parameter is specified, the list contains only the description of the specified DB cluster parameter group. </p>",
    "DescribeDBClusterParameters": "<p>Returns the detailed parameter list for a particular DB cluster parameter group.</p>",
    "DescribeDBClusterSnapshotAttributes": "<p>Returns a list of DB cluster snapshot attribute names and values for a manual DB cluster snapshot.</p> <p>When you share snapshots with other AWS accounts, <code>DescribeDBClusterSnapshotAttributes</code> returns the <code>restore</code> attribute and a list of IDs for the AWS accounts that are authorized to copy or restore the manual DB cluster snapshot. If <code>all</code> is included in the list of values for the <code>restore</code> attribute, then the manual DB cluster snapshot is public and can be copied or restored by all AWS accounts.</p>",
    "DescribeDBClusterSnapshots": "<p>Returns information about DB cluster snapshots. This API operation supports pagination.</p>",
    "DescribeDBClusters": "<p>Returns information about provisioned Amazon DocumentDB DB clusters. This API operation supports pagination.</p>",
    "DescribeDBEngineVersions": "<p>Returns a list of the available DB engines.</p>",
    "DescribeDBInstances": "<p>Returns information about provisioned Amazon DocumentDB instances. This API supports pagination.</p>",
    "DescribeDBSubnetGroups": "<p>Returns a list of <code>DBSubnetGroup</code> descriptions. If a <code>DBSubnetGroupName</code> is specified, the list will contain only the descriptions of the specified <code>DBSubnetGroup</code>.</p>",
    "DescribeEngineDefaultClusterParameters": "<p>Returns the default engine and system parameter information for the cluster database engine.</p>",
    "DescribeEventCategories": "<p>Displays a list of categories for all event source types, or, if specified, for a specified source type. </p>",
    "DescribeEvents": "<p>Returns events related to DB instances, DB security groups, DB snapshots, and DB parameter groups for the past 14 days. You can obtain events specific to a particular DB instance, DB security group, DB snapshot, or DB parameter group by providing the name as a parameter. By default, the events of the past hour are returned.</p>",
    "DescribeOrderableDBInstanceOptions": "<p>Returns a list of orderable DB instance options for the specified engine.</p>",
    "DescribePendingMaintenanceActions": "<p>Returns a list of resources (for example, DB instances) that have at least one pending maintenance action.</p>",
    "FailoverDBCluster": "<p>Forces a failover for a DB cluster.</p> <p>A failover for a DB cluster promotes one of the Amazon DocumentDB replicas (read-only instances) in the DB cluster to be the primary instance (the cluster writer).</p> <p>If the primary instance fails, Amazon DocumentDB automatically fails over to an Amazon DocumentDB replica, if one exists. You can force a failover when you want to simulate a failure of a primary instance for testing.</p>",
    "ListTagsForResource": "<p>Lists all tags on an Amazon DocumentDB resource.</p>",
    "ModifyDBCluster": "<p>Modifies a setting for an Amazon DocumentDB DB cluster. You can change one or more database configuration parameters by specifying these parameters and the new values in the request. </p>",
    "ModifyDBClusterParameterGroup": "<p> Modifies the parameters of a DB cluster parameter group. To modify more than one parameter, submit a list of the following: <code>ParameterName</code>, <code>ParameterValue</code>, and <code>ApplyMethod</code>. A maximum of 20 parameters can be modified in a single request. </p> <note> <p>Changes to dynamic parameters are applied immediately. Changes to static parameters require a reboot or maintenance window before the change can take effect.</p> </note> <important> <p>After you create a DB cluster parameter group, you should wait at least 5 minutes before creating your first DB cluster that uses that DB cluster parameter group as the default parameter group. This allows Amazon DocumentDB to fully complete the create action before the parameter group is used as the default for a new DB cluster. This step is especially important for parameters that are critical when creating the default database for a DB cluster, such as the character set for the default database defined by the <code>character_set_database</code> parameter.</p> </important>",
    "ModifyDBClusterSnapshotAttribute": "<p>Adds an attribute and values to, or removes an attribute and values from, a manual DB cluster snapshot.</p> <p>To share a manual DB cluster snapshot with other AWS accounts, specify <code>restore</code> as the <code>AttributeName</code>, and use the <code>ValuesToAdd</code> parameter to add a list of IDs of the AWS accounts that are authorized to restore the manual DB cluster snapshot. Use the value <code>all</code> to make the manual DB cluster snapshot public, which means that it can be copied or restored by all AWS accounts. Do not add the <code>all</code> value for any manual DB cluster snapshots that contain private information that you don't want available to all AWS accounts. If a manual DB cluster snapshot is encrypted, it can be shared, but only by specifying a list of authorized AWS account IDs for the <code>ValuesToAdd</code> parameter. You can't use <code>all</code> as a value for that parameter in this case.</p>",
    "ModifyDBInstance": "<p>Modifies settings for a DB instance. You can change one or more database configuration parameters by specifying these parameters and the new values in the request.</p>",
    "ModifyDBSubnetGroup": "<p>Modifies an existing DB subnet group. DB subnet groups must contain at least one subnet in at least two Availability Zones in the AWS Region.</p>",
    "RebootDBInstance": "<p>You might need to reboot your DB instance, usually for maintenance reasons. For example, if you make certain changes, or if you change the DB cluster parameter group that is associated with the DB instance, you must reboot the instance for the changes to take effect. </p> <p>Rebooting a DB instance restarts the database engine service. Rebooting a DB instance results in a momentary outage, during which the DB instance status is set to <i>rebooting</i>. </p>",
    "RemoveTagsFromResource": "<p>Removes metadata tags from an Amazon DocumentDB resource.</p>",
    "ResetDBClusterParameterGroup": "<p> Modifies the parameters of a DB cluster parameter group to the default value. To reset specific parameters, submit a list of the following: <code>ParameterName</code> and <code>ApplyMethod</code>. To reset the entire DB cluster parameter group, specify the <code>DBClusterParameterGroupName</code> and <code>ResetAllParameters</code> parameters. </p> <p> When you reset the entire group, dynamic parameters are updated immediately and static parameters are set to <code>pending-reboot</code> to take effect on the next DB instance reboot.</p>",
    "RestoreDBClusterFromSnapshot": "<p>Creates a new DB cluster from a DB snapshot or DB cluster snapshot.</p> <p>If a DB snapshot is specified, the target DB cluster is created from the source DB snapshot with a default configuration and default security group.</p> <p>If a DB cluster snapshot is specified, the target DB cluster is created from the source DB cluster restore point with the same configuration as the original source DB cluster, except that the new DB cluster is created with the default security group.</p>",
    "RestoreDBClusterToPointInTime": "<p>Restores a DB cluster to an arbitrary point in time. Users can restore to any point in time before <code>LatestRestorableTime</code> for up to <code>BackupRetentionPeriod</code> days. The target DB cluster is created from the source DB cluster with the same configuration as the original DB cluster, except that the new DB cluster is created with the default DB security group. </p>",
    "StartDBCluster": "<p>Restarts the stopped cluster that is specified by <code>DBClusterIdentifier</code>. For more information, see <a href=\"https://docs.aws.amazon.com/documentdb/latest/developerguide/db-cluster-stop-start.html\">Stopping and Starting an Amazon DocumentDB Cluster</a>.</p>",
    "StopDBCluster": "<p>Stops the running cluster that is specified by <code>DBClusterIdentifier</code>. The cluster must be in the <i>available</i> state. For more information, see <a href=\"https://docs.aws.amazon.com/documentdb/latest/developerguide/db-cluster-stop-start.html\">Stopping and Starting an Amazon DocumentDB Cluster</a>.</p>"
  },
  "shapes": {
    "AddTagsToResourceMessage": {
      "base": "<p>Represents the input to <a>AddTagsToResource</a>.</p>",
      "refs": {
      }
    },
    "ApplyMethod": {
      "base": null,
      "refs": {
        "Parameter$ApplyMethod": "<p>Indicates when to apply parameter updates.</p>"
      }
    },
    "ApplyPendingMaintenanceActionMessage": {
      "base": "<p>Represents the input to <a>ApplyPendingMaintenanceAction</a>.</p>",
      "refs": {
      }
    },
    "ApplyPendingMaintenanceActionResult": {
      "base": null,
      "refs": {
      }
    },
    "AttributeValueList": {
      "base": null,
      "refs": {
        "DBClusterSnapshotAttribute$AttributeValues": "<p>The values for the manual DB cluster snapshot attribute.</p> <p>If the <code>AttributeName</code> field is set to <code>restore</code>, then this element returns a list of IDs of the AWS accounts that are authorized to copy or restore the manual DB cluster snapshot. If a value of <code>all</code> is in the list, then the manual DB cluster snapshot is public and available for any AWS account to copy or restore.</p>",
        "ModifyDBClusterSnapshotAttributeMessage$ValuesToAdd": "<p>A list of DB cluster snapshot attributes to add to the attribute specified by <code>AttributeName</code>.</p> <p>To authorize other AWS accounts to copy or restore a manual DB cluster snapshot, set this list to include one or more AWS account IDs. To make the manual DB cluster snapshot restorable by any AWS account, set it to <code>all</code>. Do not add the <code>all</code> value for any manual DB cluster snapshots that contain private information that you don't want to be available to all AWS accounts.</p>",
        "ModifyDBClusterSnapshotAttributeMessage$ValuesToRemove": "<p>A list of DB cluster snapshot attributes to remove from the attribute specified by <code>AttributeName</code>.</p> <p>To remove authorization for other AWS accounts to copy or restore a manual DB cluster snapshot, set this list to include one or more AWS account identifiers. To remove authorization for any AWS account to copy or restore the DB cluster snapshot, set it to <code>all</code> . If you specify <code>all</code>, an AWS account whose account ID is explicitly added to the <code>restore</code> attribute can still copy or restore a manual DB cluster snapshot.</p>"
      }
    },
    "AuthorizationNotFoundFault": {
      "base": "<p>The specified CIDR IP or Amazon EC2 security group isn't authorized for the specified DB security group.</p> <p>Amazon DocumentDB also might not be authorized to perform necessary actions on your behalf using IAM.</p>",
      "refs": {
      }
    },
    "AvailabilityZone": {
      "base": "<p>Information about an Availability Zone.</p>",
      "refs": {
        "AvailabilityZoneList$member": null,
        "Subnet$SubnetAvailabilityZone": "<p>Specifies the Availability Zone for the subnet.</p>"
      }
    },
    "AvailabilityZoneList": {
      "base": null,
      "refs": {
        "OrderableDBInstanceOption$AvailabilityZones": "<p>A list of Availability Zones for a DB instance.</p>"
      }
    },
    "AvailabilityZones": {
      "base": null,
      "refs": {
        "CreateDBClusterMessage$AvailabilityZones": "<p>A list of Amazon EC2 Availability Zones that instances in the DB cluster can be created in.</p>",
        "DBCluster$AvailabilityZones": "<p>Provides the list of Amazon EC2 Availability Zones that instances in the DB cluster can be created in.</p>",
        "DBClusterSnapshot$AvailabilityZones": "<p>Provides the list of Amazon EC2 Availability Zones that instances in the DB cluster snapshot can be restored in.</p>",
        "RestoreDBClusterFromSnapshotMessage$AvailabilityZones": "<p>Provides the list of Amazon EC2 Availability Zones that instances in the restored DB cluster can be created in.</p>"
      }
    },
    "Boolean": {
      "base": null,
      "refs": {
        "DBCluster$MultiAZ": "<p>Specifies whether the DB cluster has instances in multiple Availability Zones.</p>",
        "DBCluster$StorageEncrypted": "<p>Specifies whether the DB cluster is encrypted.</p>",
        "DBCluster$DeletionProtection": "<p>Specifies whether this cluster can be deleted. If <code>DeletionProtection</code> is enabled, the cluster cannot be deleted unless it is modified and <code>DeletionProtection</code> is disabled. <code>DeletionProtection</code> protects clusters from being accidentally deleted.</p>",
        "DBClusterMember$IsClusterWriter": "<p>A value that is <code>true</code> if the cluster member is the primary instance for the DB cluster and <code>false</code> otherwise.</p>",
        "DBClusterSnapshot$StorageEncrypted": "<p>Specifies whether the DB cluster snapshot is encrypted.</p>",
        "DBEngineVersion$SupportsLogExportsToCloudwatchLogs": "<p>A value that indicates whether the engine version supports exporting the log types specified by <code>ExportableLogTypes</code> to CloudWatch Logs.</p>",
        "DBInstance$AutoMinorVersionUpgrade": "<p>Indicates that minor version patches are applied automatically.</p>",
        "DBInstance$PubliclyAccessible": "<p>Not supported. Amazon DocumentDB does not currently support public endpoints. The value of <code>PubliclyAccessible</code> is always <code>false</code>.</p>",
        "DBInstance$StorageEncrypted": "<p>Specifies whether or not the DB instance is encrypted.</p>",
        "DBInstanceStatusInfo$Normal": "<p>A Boolean value that is <code>true</code> if the instance is operating normally, or <code>false</code> if the instance is in an error state.</p>",
        "DeleteDBClusterMessage$SkipFinalSnapshot": "<p> Determines whether a final DB cluster snapshot is created before the DB cluster is deleted. If <code>true</code> is specified, no DB cluster snapshot is created. If <code>false</code> is specified, a DB cluster snapshot is created before the DB cluster is deleted. </p> <note> <p>If <code>SkipFinalSnapshot</code> is <code>false</code>, you must specify a <code>FinalDBSnapshotIdentifier</code> parameter.</p> </note> <p>Default: <code>false</code> </p>",
        "DescribeDBClusterSnapshotsMessage$IncludeShared": "<p>Set to <code>true</code> to include shared manual DB cluster snapshots from other AWS accounts that this AWS account has been given permission to copy or restore, and otherwise <code>false</code>. The default is <code>false</code>.</p>",
        "DescribeDBClusterSnapshotsMessage$IncludePublic": "<p>Set to <code>true</code> to include manual DB cluster snapshots that are public and can be copied or restored by any AWS account, and otherwise <code>false</code>. The default is <code>false</code>.</p>",
        "DescribeDBEngineVersionsMessage$DefaultOnly": "<p>Indicates that only the default version of the specified engine or engine and major version combination is returned.</p>",
        "ModifyDBClusterMessage$ApplyImmediately": "<p>A value that specifies whether the changes in this request and any pending changes are asynchronously applied as soon as possible, regardless of the <code>PreferredMaintenanceWindow</code> setting for the DB cluster. If this parameter is set to <code>false</code>, changes to the DB cluster are applied during the next maintenance window.</p> <p>The <code>ApplyImmediately</code> parameter affects only the <code>NewDBClusterIdentifier</code> and <code>MasterUserPassword</code> values. If you set this parameter value to <code>false</code>, the changes to the <code>NewDBClusterIdentifier</code> and <code>MasterUserPassword</code> values are applied during the next maintenance window. All other changes are applied immediately, regardless of the value of the <code>ApplyImmediately</code> parameter.</p> <p>Default: <code>false</code> </p>",
        "ModifyDBInstanceMessage$ApplyImmediately": "<p>Specifies whether the modifications in this request and any pending modifications are asynchronously applied as soon as possible, regardless of the <code>PreferredMaintenanceWindow</code> setting for the DB instance. </p> <p> If this parameter is set to <code>false</code>, changes to the DB instance are applied during the next maintenance window. Some parameter changes can cause an outage and are applied on the next reboot.</p> <p>Default: <code>false</code> </p>",
        "OrderableDBInstanceOption$Vpc": "<p>Indicates whether a DB instance is in a virtual private cloud (VPC).</p>",
        "Parameter$IsModifiable": "<p> Indicates whether (<code>true</code>) or not (<code>false</code>) the parameter can be modified. Some parameters have security or operational implications that prevent them from being changed. </p>",
        "ResetDBClusterParameterGroupMessage$ResetAllParameters": "<p>A value that is set to <code>true</code> to reset all parameters in the DB cluster parameter group to their default values, and <code>false</code> otherwise. You can't use this parameter if there is a list of parameter names specified for the <code>Parameters</code> parameter.</p>",
        "RestoreDBClusterToPointInTimeMessage$UseLatestRestorableTime": "<p>A value that is set to <code>true</code> to restore the DB cluster to the latest restorable backup time, and <code>false</code> otherwise. </p> <p>Default: <code>false</code> </p> <p>Constraints: Cannot be specified if the <code>RestoreToTime</code> parameter is provided.</p>",
        "UpgradeTarget$AutoUpgrade": "<p>A value that indicates whether the target version is applied to any source DB instances that have <code>AutoMinorVersionUpgrade</code> set to <code>true</code>.</p>",
        "UpgradeTarget$IsMajorVersionUpgrade": "<p>A value that indicates whether a database engine is upgraded to a major version.</p>"
      }
    },
    "BooleanOptional": {
      "base": null,
      "refs": {
        "CopyDBClusterSnapshotMessage$CopyTags": "<p>Set to <code>true</code> to copy all tags from the source DB cluster snapshot to the target DB cluster snapshot, and otherwise <code>false</code>. The default is <code>false</code>.</p>",
        "CreateDBClusterMessage$StorageEncrypted": "<p>Specifies whether the DB cluster is encrypted.</p>",
        "CreateDBClusterMessage$DeletionProtection": "<p>Specifies whether this cluster can be deleted. If <code>DeletionProtection</code> is enabled, the cluster cannot be deleted unless it is modified and <code>DeletionProtection</code> is disabled. <code>DeletionProtection</code> protects clusters from being accidentally deleted.</p>",
        "CreateDBInstanceMessage$AutoMinorVersionUpgrade": "<p>Indicates that minor engine upgrades are applied automatically to the DB instance during the maintenance window.</p> <p>Default: <code>true</code> </p>",
        "DescribeDBEngineVersionsMessage$ListSupportedCharacterSets": "<p>If this parameter is specified and the requested engine supports the <code>CharacterSetName</code> parameter for <code>CreateDBInstance</code>, the response includes a list of supported character sets for each engine version. </p>",
        "DescribeDBEngineVersionsMessage$ListSupportedTimezones": "<p>If this parameter is specified and the requested engine supports the <code>TimeZone</code> parameter for <code>CreateDBInstance</code>, the response includes a list of supported time zones for each engine version. </p>",
        "DescribeOrderableDBInstanceOptionsMessage$Vpc": "<p>The virtual private cloud (VPC) filter value. Specify this parameter to show only the available VPC or non-VPC offerings.</p>",
        "ModifyDBClusterMessage$DeletionProtection": "<p>Specifies whether this cluster can be deleted. If <code>DeletionProtection</code> is enabled, the cluster cannot be deleted unless it is modified and <code>DeletionProtection</code> is disabled. <code>DeletionProtection</code> protects clusters from being accidentally deleted.</p>",
        "ModifyDBInstanceMessage$AutoMinorVersionUpgrade": "<p>Indicates that minor version upgrades are applied automatically to the DB instance during the maintenance window. Changing this parameter doesn't result in an outage except in the following case, and the change is asynchronously applied as soon as possible. An outage results if this parameter is set to <code>true</code> during the maintenance window, and a newer minor version is available, and Amazon DocumentDB has enabled automatic patching for that engine version. </p>",
        "PendingModifiedValues$MultiAZ": "<p>Indicates that the Single-AZ DB instance is to change to a Multi-AZ deployment.</p>",
        "RebootDBInstanceMessage$ForceFailover": "<p> When <code>true</code>, the reboot is conducted through a Multi-AZ failover. </p> <p>Constraint: You can't specify <code>true</code> if the instance is not configured for Multi-AZ.</p>",
        "RestoreDBClusterFromSnapshotMessage$DeletionProtection": "<p>Specifies whether this cluster can be deleted. If <code>DeletionProtection</code> is enabled, the cluster cannot be deleted unless it is modified and <code>DeletionProtection</code> is disabled. <code>DeletionProtection</code> protects clusters from being accidentally deleted.</p>",
        "RestoreDBClusterToPointInTimeMessage$DeletionProtection": "<p>Specifies whether this cluster can be deleted. If <code>DeletionProtection</code> is enabled, the cluster cannot be deleted unless it is modified and <code>DeletionProtection</code> is disabled. <code>DeletionProtection</code> protects clusters from being accidentally deleted.</p>"
      }
    },
    "Certificate": {
      "base": "<p>A certificate authority (CA) certificate for an AWS account.</p>",
      "refs": {
        "CertificateList$member": null
      }
    },
    "CertificateList": {
      "base": null,
      "refs": {
        "CertificateMessage$Certificates": "<p>A list of certificates for this AWS account.</p>"
      }
    },
    "CertificateMessage": {
      "base": null,
      "refs": {
      }
    },
    "CertificateNotFoundFault": {
      "base": "<p> <code>CertificateIdentifier</code> doesn't refer to an existing certificate. </p>",
      "refs": {
      }
    },
    "CloudwatchLogsExportConfiguration": {
      "base": "<p>The configuration setting for the log types to be enabled for export to Amazon CloudWatch Logs for a specific DB instance or DB cluster.</p> <p>The <code>EnableLogTypes</code> and <code>DisableLogTypes</code> arrays determine which logs are exported (or not exported) to CloudWatch Logs. The values within these arrays depend on the DB engine that is being used.</p>",
      "refs": {
        "ModifyDBClusterMessage$CloudwatchLogsExportConfiguration": "<p>The configuration setting for the log types to be enabled for export to Amazon CloudWatch Logs for a specific DB instance or DB cluster. The <code>EnableLogTypes</code> and <code>DisableLogTypes</code> arrays determine which logs are exported (or not exported) to CloudWatch Logs.</p>"
      }
    },
    "CopyDBClusterParameterGroupMessage": {
      "base": "<p>Represents the input to <a>CopyDBClusterParameterGroup</a>.</p>",
      "refs": {
      }
    },
    "CopyDBClusterParameterGroupResult": {
      "base": null,
      "refs": {
      }
    },
    "CopyDBClusterSnapshotMessage": {
      "base": "<p>Represents the input to <a>CopyDBClusterSnapshot</a>.</p>",
      "refs": {
      }
    },
    "CopyDBClusterSnapshotResult": {
      "base": null,
      "refs": {
      }
    },
    "CreateDBClusterMessage": {
      "base": "<p>Represents the input to <a>CreateDBCluster</a>.</p>",
      "refs": {
      }
    },
    "CreateDBClusterParameterGroupMessage": {
      "base": "<p>Represents the input of <a>CreateDBClusterParameterGroup</a>.</p>",
      "refs": {
      }
    },
    "CreateDBClusterParameterGroupResult": {
      "base": null,
      "refs": {
      }
    },
    "CreateDBClusterResult": {
      "base": null,
      "refs": {
      }
    },
    "CreateDBClusterSnapshotMessage": {
      "base": "<p>Represents the input of <a>CreateDBClusterSnapshot</a>.</p>",
      "refs": {
      }
    },
    "CreateDBClusterSnapshotResult": {
      "base": null,
      "refs": {
      }
    },
    "CreateDBInstanceMessage": {
      "base": "<p>Represents the input to <a>CreateDBInstance</a>.</p>",
      "refs": {
      }
    },
    "CreateDBInstanceResult": {
      "base": null,
      "refs": {
      }
    },
    "CreateDBSubnetGroupMessage": {
      "base": "<p>Represents the input to <a>CreateDBSubnetGroup</a>.</p>",
      "refs": {
      }
    },
    "CreateDBSubnetGroupResult": {
      "base": null,
      "refs": {
      }
    },
    "DBCluster": {
      "base": "<p>Detailed information about a DB cluster. </p>",
      "refs": {
        "CreateDBClusterResult$DBCluster": null,
        "DBClusterList$member": null,
        "DeleteDBClusterResult$DBCluster": null,
        "FailoverDBClusterResult$DBCluster": null,
        "ModifyDBClusterResult$DBCluster": null,
        "RestoreDBClusterFromSnapshotResult$DBCluster": null,
        "RestoreDBClusterToPointInTimeResult$DBCluster": null,
        "StartDBClusterResult$DBCluster": null,
        "StopDBClusterResult$DBCluster": null
      }
    },
    "DBClusterAlreadyExistsFault": {
      "base": "<p>You already have a DB cluster with the given identifier.</p>",
      "refs": {
      }
    },
    "DBClusterList": {
      "base": null,
      "refs": {
        "DBClusterMessage$DBClusters": "<p>A list of DB clusters.</p>"
      }
    },
    "DBClusterMember": {
      "base": "<p>Contains information about an instance that is part of a DB cluster.</p>",
      "refs": {
        "DBClusterMemberList$member": null
      }
    },
    "DBClusterMemberList": {
      "base": null,
      "refs": {
        "DBCluster$DBClusterMembers": "<p>Provides the list of instances that make up the DB cluster.</p>"
      }
    },
    "DBClusterMessage": {
      "base": "<p>Represents the output of <a>DescribeDBClusters</a>.</p>",
      "refs": {
      }
    },
    "DBClusterNotFoundFault": {
      "base": "<p> <code>DBClusterIdentifier</code> doesn't refer to an existing DB cluster. </p>",
      "refs": {
      }
    },
    "DBClusterParameterGroup": {
      "base": "<p>Detailed information about a DB cluster parameter group. </p>",
      "refs": {
        "CopyDBClusterParameterGroupResult$DBClusterParameterGroup": null,
        "CreateDBClusterParameterGroupResult$DBClusterParameterGroup": null,
        "DBClusterParameterGroupList$member": null
      }
    },
    "DBClusterParameterGroupDetails": {
      "base": "<p>Represents the output of <a>DBClusterParameterGroup</a>.</p>",
      "refs": {
      }
    },
    "DBClusterParameterGroupList": {
      "base": null,
      "refs": {
        "DBClusterParameterGroupsMessage$DBClusterParameterGroups": "<p>A list of DB cluster parameter groups.</p>"
      }
    },
    "DBClusterParameterGroupNameMessage": {
      "base": "<p>Contains the name of a DB cluster parameter group.</p>",
      "refs": {
      }
    },
    "DBClusterParameterGroupNotFoundFault": {
      "base": "<p> <code>DBClusterParameterGroupName</code> doesn't refer to an existing DB cluster parameter group. </p>",
      "refs": {
      }
    },
    "DBClusterParameterGroupsMessage": {
      "base": "<p>Represents the output of <a>DBClusterParameterGroups</a>.</p>",
      "refs": {
      }
    },
    "DBClusterQuotaExceededFault": {
      "base": "<p>The DB cluster can't be created because you have reached the maximum allowed quota of DB clusters.</p>",
      "refs": {
      }
    },
    "DBClusterRole": {
      "base": "<p>Describes an AWS Identity and Access Management (IAM) role that is associated with a DB cluster.</p>",
      "refs": {
        "DBClusterRoles$member": null
      }
    },
    "DBClusterRoles": {
      "base": null,
      "refs": {
        "DBCluster$AssociatedRoles": "<p>Provides a list of the AWS Identity and Access Management (IAM) roles that are associated with the DB cluster. IAM roles that are associated with a DB cluster grant permission for the DB cluster to access other AWS services on your behalf.</p>"
      }
    },
    "DBClusterSnapshot": {
      "base": "<p>Detailed information about a DB cluster snapshot. </p>",
      "refs": {
        "CopyDBClusterSnapshotResult$DBClusterSnapshot": null,
        "CreateDBClusterSnapshotResult$DBClusterSnapshot": null,
        "DBClusterSnapshotList$member": null,
        "DeleteDBClusterSnapshotResult$DBClusterSnapshot": null
      }
    },
    "DBClusterSnapshotAlreadyExistsFault": {
      "base": "<p>You already have a DB cluster snapshot with the given identifier.</p>",
      "refs": {
      }
    },
    "DBClusterSnapshotAttribute": {
      "base": "<p>Contains the name and values of a manual DB cluster snapshot attribute.</p> <p>Manual DB cluster snapshot attributes are used to authorize other AWS accounts to restore a manual DB cluster snapshot.</p>",
      "refs": {
        "DBClusterSnapshotAttributeList$member": null
      }
    },
    "DBClusterSnapshotAttributeList": {
      "base": null,
      "refs": {
        "DBClusterSnapshotAttributesResult$DBClusterSnapshotAttributes": "<p>The list of attributes and values for the DB cluster snapshot.</p>"
      }
    },
    "DBClusterSnapshotAttributesResult": {
      "base": "<p>Detailed information about the attributes that are associated with a DB cluster snapshot.</p>",
      "refs": {
        "DescribeDBClusterSnapshotAttributesResult$DBClusterSnapshotAttributesResult": null,
        "ModifyDBClusterSnapshotAttributeResult$DBClusterSnapshotAttributesResult": null
      }
    },
    "DBClusterSnapshotList": {
      "base": null,
      "refs": {
        "DBClusterSnapshotMessage$DBClusterSnapshots": "<p>Provides a list of DB cluster snapshots.</p>"
      }
    },
    "DBClusterSnapshotMessage": {
      "base": "<p>Represents the output of <a>DescribeDBClusterSnapshots</a>.</p>",
      "refs": {
      }
    },
    "DBClusterSnapshotNotFoundFault": {
      "base": "<p> <code>DBClusterSnapshotIdentifier</code> doesn't refer to an existing DB cluster snapshot. </p>",
      "refs": {
      }
    },
    "DBEngineVersion": {
      "base": "<p> Detailed information about a DB engine version. </p>",
      "refs": {
        "DBEngineVersionList$member": null
      }
    },
    "DBEngineVersionList": {
      "base": null,
      "refs": {
        "DBEngineVersionMessage$DBEngineVersions": "<p>Detailed information about one or more DB engine versions.</p>"
      }
    },
    "DBEngineVersionMessage": {
      "base": "<p>Represents the output of <a>DescribeDBEngineVersions</a>.</p>",
      "refs": {
      }
    },
    "DBInstance": {
      "base": "<p>Detailed information about a DB instance. </p>",
      "refs": {
        "CreateDBInstanceResult$DBInstance": null,
        "DBInstanceList$member": null,
        "DeleteDBInstanceResult$DBInstance": null,
        "ModifyDBInstanceResult$DBInstance": null,
        "RebootDBInstanceResult$DBInstance": null
      }
    },
    "DBInstanceAlreadyExistsFault": {
      "base": "<p>You already have a DB instance with the given identifier.</p>",
      "refs": {
      }
    },
    "DBInstanceList": {
      "base": null,
      "refs": {
        "DBInstanceMessage$DBInstances": "<p>Detailed information about one or more DB instances. </p>"
      }
    },
    "DBInstanceMessage": {
      "base": "<p>Represents the output of <a>DescribeDBInstances</a>.</p>",
      "refs": {
      }
    },
    "DBInstanceNotFoundFault": {
      "base": "<p> <code>DBInstanceIdentifier</code> doesn't refer to an existing DB instance. </p>",
      "refs": {
      }
    },
    "DBInstanceStatusInfo": {
      "base": "<p>Provides a list of status information for a DB instance.</p>",
      "refs": {
        "DBInstanceStatusInfoList$member": null
      }
    },
    "DBInstanceStatusInfoList": {
      "base": null,
      "refs": {
        "DBInstance$StatusInfos": "<p>The status of a read replica. If the instance is not a read replica, this is blank.</p>"
      }
    },
    "DBParameterGroupAlreadyExistsFault": {
      "base": "<p>A DB parameter group with the same name already exists.</p>",
      "refs": {
      }
    },
    "DBParameterGroupNotFoundFault": {
      "base": "<p> <code>DBParameterGroupName</code> doesn't refer to an existing DB parameter group. </p>",
      "refs": {
      }
    },
    "DBParameterGroupQuotaExceededFault": {
      "base": "<p>This request would cause you to exceed the allowed number of DB parameter groups.</p>",
      "refs": {
      }
    },
    "DBSecurityGroupNotFoundFault": {
      "base": "<p> <code>DBSecurityGroupName</code> doesn't refer to an existing DB security group. </p>",
      "refs": {
      }
    },
    "DBSnapshotAlreadyExistsFault": {
      "base": "<p> <code>DBSnapshotIdentifier</code> is already being used by an existing snapshot. </p>",
      "refs": {
      }
    },
    "DBSnapshotNotFoundFault": {
      "base": "<p> <code>DBSnapshotIdentifier</code> doesn't refer to an existing DB snapshot. </p>",
      "refs": {
      }
    },
    "DBSubnetGroup": {
      "base": "<p>Detailed information about a DB subnet group. </p>",
      "refs": {
        "CreateDBSubnetGroupResult$DBSubnetGroup": null,
        "DBInstance$DBSubnetGroup": "<p>Specifies information on the subnet group that is associated with the DB instance, including the name, description, and subnets in the subnet group.</p>",
        "DBSubnetGroups$member": null,
        "ModifyDBSubnetGroupResult$DBSubnetGroup": null
      }
    },
    "DBSubnetGroupAlreadyExistsFault": {
      "base": "<p> <code>DBSubnetGroupName</code> is already being used by an existing DB subnet group. </p>",
      "refs": {
      }
    },
    "DBSubnetGroupDoesNotCoverEnoughAZs": {
      "base": "<p>Subnets in the DB subnet group should cover at least two Availability Zones unless there is only one Availability Zone.</p>",
      "refs": {
      }
    },
    "DBSubnetGroupMessage": {
      "base": "<p>Represents the output of <a>DescribeDBSubnetGroups</a>.</p>",
      "refs": {
      }
    },
    "DBSubnetGroupNotFoundFault": {
      "base": "<p> <code>DBSubnetGroupName</code> doesn't refer to an existing DB subnet group. </p>",
      "refs": {
      }
    },
    "DBSubnetGroupQuotaExceededFault": {
      "base": "<p>The request would cause you to exceed the allowed number of DB subnet groups.</p>",
      "refs": {
      }
    },
    "DBSubnetGroups": {
      "base": null,
      "refs": {
        "DBSubnetGroupMessage$DBSubnetGroups": "<p>Detailed information about one or more DB subnet groups.</p>"
      }
    },
    "DBSubnetQuotaExceededFault": {
      "base": "<p>The request would cause you to exceed the allowed number of subnets in a DB subnet group.</p>",
      "refs": {
      }
    },
    "DBUpgradeDependencyFailureFault": {
      "base": "<p>The DB upgrade failed because a resource that the DB depends on can't be modified.</p>",
      "refs": {
      }
    },
    "DeleteDBClusterMessage": {
      "base": "<p>Represents the input to <a>DeleteDBCluster</a>.</p>",
      "refs": {
      }
    },
    "DeleteDBClusterParameterGroupMessage": {
      "base": "<p>Represents the input to <a>DeleteDBClusterParameterGroup</a>.</p>",
      "refs": {
      }
    },
    "DeleteDBClusterResult": {
      "base": null,
      "refs": {
      }
    },
    "DeleteDBClusterSnapshotMessage": {
      "base": "<p>Represents the input to <a>DeleteDBClusterSnapshot</a>.</p>",
      "refs": {
      }
    },
    "DeleteDBClusterSnapshotResult": {
      "base": null,
      "refs": {
      }
    },
    "DeleteDBInstanceMessage": {
      "base": "<p>Represents the input to <a>DeleteDBInstance</a>.</p>",
      "refs": {
      }
    },
    "DeleteDBInstanceResult": {
      "base": null,
      "refs": {
      }
    },
    "DeleteDBSubnetGroupMessage": {
      "base": "<p>Represents the input to <a>DeleteDBSubnetGroup</a>.</p>",
      "refs": {
      }
    },
    "DescribeCertificatesMessage": {
      "base": null,
      "refs": {
      }
    },
    "DescribeDBClusterParameterGroupsMessage": {
      "base": "<p>Represents the input to <a>DescribeDBClusterParameterGroups</a>.</p>",
      "refs": {
      }
    },
    "DescribeDBClusterParametersMessage": {
      "base": "<p>Represents the input to <a>DescribeDBClusterParameters</a>.</p>",
      "refs": {
      }
    },
    "DescribeDBClusterSnapshotAttributesMessage": {
      "base": "<p>Represents the input to <a>DescribeDBClusterSnapshotAttributes</a>.</p>",
      "refs": {
      }
    },
    "DescribeDBClusterSnapshotAttributesResult": {
      "base": null,
      "refs": {
      }
    },
    "DescribeDBClusterSnapshotsMessage": {
      "base": "<p>Represents the input to <a>DescribeDBClusterSnapshots</a>.</p>",
      "refs": {
      }
    },
    "DescribeDBClustersMessage": {
      "base": "<p>Represents the input to <a>DescribeDBClusters</a>.</p>",
      "refs": {
      }
    },
    "DescribeDBEngineVersionsMessage": {
      "base": "<p>Represents the input to <a>DescribeDBEngineVersions</a>.</p>",
      "refs": {
      }
    },
    "DescribeDBInstancesMessage": {
      "base": "<p>Represents the input to <a>DescribeDBInstances</a>.</p>",
      "refs": {
      }
    },
    "DescribeDBSubnetGroupsMessage": {
      "base": "<p>Represents the input to <a>DescribeDBSubnetGroups</a>.</p>",
      "refs": {
      }
    },
    "DescribeEngineDefaultClusterParametersMessage": {
      "base": "<p>Represents the input to <a>DescribeEngineDefaultClusterParameters</a>.</p>",
      "refs": {
      }
    },
    "DescribeEngineDefaultClusterParametersResult": {
      "base": null,
      "refs": {
      }
    },
    "DescribeEventCategoriesMessage": {
      "base": "<p>Represents the input to <a>DescribeEventCategories</a>.</p>",
      "refs": {
      }
    },
    "DescribeEventsMessage": {
      "base": "<p>Represents the input to <a>DescribeEvents</a>.</p>",
      "refs": {
      }
    },
    "DescribeOrderableDBInstanceOptionsMessage": {
      "base": "<p>Represents the input to <a>DescribeOrderableDBInstanceOptions</a>.</p>",
      "refs": {
      }
    },
    "DescribePendingMaintenanceActionsMessage": {
      "base": "<p>Represents the input to <a>DescribePendingMaintenanceActions</a>.</p>",
      "refs": {
      }
    },
    "Endpoint": {
      "base": "<p>Network information for accessing a DB cluster or DB instance. Client programs must specify a valid endpoint to access these Amazon DocumentDB resources.</p>",
      "refs": {
        "DBInstance$Endpoint": "<p>Specifies the connection endpoint.</p>"
      }
    },
    "EngineDefaults": {
      "base": "<p>Contains the result of a successful invocation of the <code>DescribeEngineDefaultClusterParameters</code> operation. </p>",
      "refs": {
        "DescribeEngineDefaultClusterParametersResult$EngineDefaults": null
      }
    },
    "Event": {
      "base": "<p>Detailed information about an event.</p>",
      "refs": {
        "EventList$member": null
      }
    },
    "EventCategoriesList": {
      "base": null,
      "refs": {
        "DescribeEventsMessage$EventCategories": "<p>A list of event categories that trigger notifications for an event notification subscription.</p>",
        "Event$EventCategories": "<p>Specifies the category for the event.</p>",
        "EventCategoriesMap$EventCategories": "<p>The event categories for the specified source type.</p>"
      }
    },
    "EventCategoriesMap": {
      "base": "<p>An event source type, accompanied by one or more event category names.</p>",
      "refs": {
        "EventCategoriesMapList$member": null
      }
    },
    "EventCategoriesMapList": {
      "base": null,
      "refs": {
        "EventCategoriesMessage$EventCategoriesMapList": "<p>A list of event category maps.</p>"
      }
    },
    "EventCategoriesMessage": {
      "base": "<p>Represents the output of <a>DescribeEventCategories</a>.</p>",
      "refs": {
      }
    },
    "EventList": {
      "base": null,
      "refs": {
        "EventsMessage$Events": "<p>Detailed information about one or more events. </p>"
      }
    },
    "EventsMessage": {
      "base": "<p>Represents the output of <a>DescribeEvents</a>.</p>",
      "refs": {
      }
    },
    "FailoverDBClusterMessage": {
      "base": "<p>Represents the input to <a>FailoverDBCluster</a>.</p>",
      "refs": {
      }
    },
    "FailoverDBClusterResult": {
      "base": null,
      "refs": {
      }
    },
    "Filter": {
      "base": "<p>A named set of filter values, used to return a more specific list of results. You can use a filter to match a set of resources by specific criteria, such as IDs.</p> <p>Wildcards are not supported in filters.</p>",
      "refs": {
        "FilterList$member": null
      }
    },
    "FilterList": {
      "base": null,
      "refs": {
        "DescribeCertificatesMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribeDBClusterParameterGroupsMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribeDBClusterParametersMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribeDBClusterSnapshotsMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribeDBClustersMessage$Filters": "<p>A filter that specifies one or more DB clusters to describe.</p> <p>Supported filters:</p> <ul> <li> <p> <code>db-cluster-id</code> - Accepts DB cluster identifiers and DB cluster Amazon Resource Names (ARNs). The results list only includes information about the DB clusters identified by these ARNs.</p> </li> </ul>",
        "DescribeDBEngineVersionsMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribeDBInstancesMessage$Filters": "<p>A filter that specifies one or more DB instances to describe.</p> <p>Supported filters:</p> <ul> <li> <p> <code>db-cluster-id</code> - Accepts DB cluster identifiers and DB cluster Amazon Resource Names (ARNs). The results list includes only the information about the DB instances that are associated with the DB clusters that are identified by these ARNs.</p> </li> <li> <p> <code>db-instance-id</code> - Accepts DB instance identifiers and DB instance ARNs. The results list includes only the information about the DB instances that are identified by these ARNs.</p> </li> </ul>",
        "DescribeDBSubnetGroupsMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribeEngineDefaultClusterParametersMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribeEventCategoriesMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribeEventsMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribeOrderableDBInstanceOptionsMessage$Filters": "<p>This parameter is not currently supported.</p>",
        "DescribePendingMaintenanceActionsMessage$Filters": "<p>A filter that specifies one or more resources to return pending maintenance actions for.</p> <p>Supported filters:</p> <ul> <li> <p> <code>db-cluster-id</code> - Accepts DB cluster identifiers and DB cluster Amazon Resource Names (ARNs). The results list includes only pending maintenance actions for the DB clusters identified by these ARNs.</p> </li> <li> <p> <code>db-instance-id</code> - Accepts DB instance identifiers and DB instance ARNs. The results list includes only pending maintenance actions for the DB instances identified by these ARNs.</p> </li> </ul>",
        "ListTagsForResourceMessage$Filters": "<p>This parameter is not currently supported.</p>"
      }
    },
    "FilterValueList": {
      "base": null,
      "refs": {
        "Filter$Values": "<p>One or more filter values. Filter values are case sensitive.</p>"
      }
    },
    "InstanceQuotaExceededFault": {
      "base": "<p>The request would cause you to exceed the allowed number of DB instances.</p>",
      "refs": {
      }
    },
    "InsufficientDBClusterCapacityFault": {
      "base": "<p>The DB cluster doesn't have enough capacity for the current operation.</p>",
      "refs": {
      }
    },
    "InsufficientDBInstanceCapacityFault": {
      "base": "<p>The specified DB instance class isn't available in the specified Availability Zone.</p>",
      "refs": {
      }
    },
    "InsufficientStorageClusterCapacityFault": {
      "base": "<p>There is not enough storage available for the current action. You might be able to resolve this error by updating your subnet group to use different Availability Zones that have more storage available. </p>",
      "refs": {
      }
    },
    "Integer": {
      "base": null,
      "refs": {
        "DBClusterSnapshot$Port": "<p>Specifies the port that the DB cluster was listening on at the time of the snapshot.</p>",
        "DBClusterSnapshot$PercentProgress": "<p>Specifies the percentage of the estimated data that has been transferred.</p>",
        "DBInstance$BackupRetentionPeriod": "<p>Specifies the number of days for which automatic DB snapshots are retained.</p>",
        "Endpoint$Port": "<p>Specifies the port that the database engine is listening on.</p>"
      }
    },
    "IntegerOptional": {
      "base": null,
      "refs": {
        "CreateDBClusterMessage$BackupRetentionPeriod": "<p>The number of days for which automated backups are retained. You must specify a minimum value of 1.</p> <p>Default: 1</p> <p>Constraints:</p> <ul> <li> <p>Must be a value from 1 to 35.</p> </li> </ul>",
        "CreateDBClusterMessage$Port": "<p>The port number on which the instances in the DB cluster accept connections.</p>",
        "CreateDBInstanceMessage$PromotionTier": "<p>A value that specifies the order in which an Amazon DocumentDB replica is promoted to the primary instance after a failure of the existing primary instance.</p> <p>Default: 1</p> <p>Valid values: 0-15</p>",
        "DBCluster$BackupRetentionPeriod": "<p>Specifies the number of days for which automatic DB snapshots are retained.</p>",
        "DBCluster$Port": "<p>Specifies the port that the database engine is listening on.</p>",
        "DBClusterMember$PromotionTier": "<p>A value that specifies the order in which an Amazon DocumentDB replica is promoted to the primary instance after a failure of the existing primary instance. </p>",
        "DBInstance$PromotionTier": "<p>A value that specifies the order in which an Amazon DocumentDB replica is promoted to the primary instance after a failure of the existing primary instance.</p>",
        "DescribeCertificatesMessage$MaxRecords": "<p>The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token called a marker is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints:</p> <ul> <li> <p>Minimum: 20</p> </li> <li> <p>Maximum: 100</p> </li> </ul>",
        "DescribeDBClusterParameterGroupsMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribeDBClusterParametersMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribeDBClusterSnapshotsMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribeDBClustersMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribeDBEngineVersionsMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribeDBInstancesMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribeDBSubnetGroupsMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribeEngineDefaultClusterParametersMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribeEventsMessage$Duration": "<p>The number of minutes to retrieve events for.</p> <p>Default: 60</p>",
        "DescribeEventsMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribeOrderableDBInstanceOptionsMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "DescribePendingMaintenanceActionsMessage$MaxRecords": "<p> The maximum number of records to include in the response. If more records exist than the specified <code>MaxRecords</code> value, a pagination token (marker) is included in the response so that the remaining results can be retrieved.</p> <p>Default: 100</p> <p>Constraints: Minimum 20, maximum 100.</p>",
        "ModifyDBClusterMessage$BackupRetentionPeriod": "<p>The number of days for which automated backups are retained. You must specify a minimum value of 1.</p> <p>Default: 1</p> <p>Constraints:</p> <ul> <li> <p>Must be a value from 1 to 35.</p> </li> </ul>",
        "ModifyDBClusterMessage$Port": "<p>The port number on which the DB cluster accepts connections.</p> <p>Constraints: Must be a value from <code>1150</code> to <code>65535</code>. </p> <p>Default: The same port as the original DB cluster.</p>",
        "ModifyDBInstanceMessage$PromotionTier": "<p>A value that specifies the order in which an Amazon DocumentDB replica is promoted to the primary instance after a failure of the existing primary instance.</p> <p>Default: 1</p> <p>Valid values: 0-15</p>",
        "PendingModifiedValues$AllocatedStorage": "<p> Contains the new <code>AllocatedStorage</code> size for the DB instance that will be applied or is currently being applied. </p>",
        "PendingModifiedValues$Port": "<p>Specifies the pending port for the DB instance.</p>",
        "PendingModifiedValues$BackupRetentionPeriod": "<p>Specifies the pending number of days for which automated backups are retained.</p>",
        "PendingModifiedValues$Iops": "<p>Specifies the new Provisioned IOPS value for the DB instance that will be applied or is currently being applied.</p>",
        "RestoreDBClusterFromSnapshotMessage$Port": "<p>The port number on which the new DB cluster accepts connections.</p> <p>Constraints: Must be a value from <code>1150</code> to <code>65535</code>.</p> <p>Default: The same port as the original DB cluster.</p>",
        "RestoreDBClusterToPointInTimeMessage$Port": "<p>The port number on which the new DB cluster accepts connections.</p> <p>Constraints: Must be a value from <code>1150</code> to <code>65535</code>. </p> <p>Default: The default port for the engine.</p>"
      }
    },
    "InvalidDBClusterSnapshotStateFault": {
      "base": "<p>The provided value isn't a valid DB cluster snapshot state.</p>",
      "refs": {
      }
    },
    "InvalidDBClusterStateFault": {
      "base": "<p>The DB cluster isn't in a valid state.</p>",
      "refs": {
      }
    },
    "InvalidDBInstanceStateFault": {
      "base": "<p> The specified DB instance isn't in the <i>available</i> state. </p>",
      "refs": {
      }
    },
    "InvalidDBParameterGroupStateFault": {
      "base": "<p>The DB parameter group is in use, or it is in a state that is not valid. If you are trying to delete the parameter group, you can't delete it when the parameter group is in this state.</p>",
      "refs": {
      }
    },
    "InvalidDBSecurityGroupStateFault": {
      "base": "<p>The state of the DB security group doesn't allow deletion.</p>",
      "refs": {
      }
    },
    "InvalidDBSnapshotStateFault": {
      "base": "<p>The state of the DB snapshot doesn't allow deletion.</p>",
      "refs": {
      }
    },
    "InvalidDBSubnetGroupStateFault": {
      "base": "<p>The DB subnet group can't be deleted because it's in use.</p>",
      "refs": {
      }
    },
    "InvalidDBSubnetStateFault": {
      "base": "<p> The DB subnet isn't in the <i>available</i> state. </p>",
      "refs": {
      }
    },
    "InvalidRestoreFault": {
      "base": "<p>You cannot restore from a virtual private cloud (VPC) backup to a non-VPC DB instance.</p>",
      "refs": {
      }
    },
    "InvalidSubnet": {
      "base": "<p>The requested subnet is not valid, or multiple subnets were requested that are not all in a common virtual private cloud (VPC).</p>",
      "refs": {
      }
    },
    "InvalidVPCNetworkStateFault": {
      "base": "<p>The DB subnet group doesn't cover all Availability Zones after it is created because of changes that were made.</p>",
      "refs": {
      }
    },
    "KMSKeyNotAccessibleFault": {
      "base": "<p>An error occurred when accessing an AWS KMS key.</p>",
      "refs": {
      }
    },
    "KeyList": {
      "base": null,
      "refs": {
        "RemoveTagsFromResourceMessage$TagKeys": "<p>The tag key (name) of the tag to be removed.</p>"
      }
    },
    "ListTagsForResourceMessage": {
      "base": "<p>Represents the input to <a>ListTagsForResource</a>.</p>",
      "refs": {
      }
    },
    "LogTypeList": {
      "base": null,
      "refs": {
        "CloudwatchLogsExportConfiguration$EnableLogTypes": "<p>The list of log types to enable.</p>",
        "CloudwatchLogsExportConfiguration$DisableLogTypes": "<p>The list of log types to disable.</p>",
        "CreateDBClusterMessage$EnableCloudwatchLogsExports": "<p>A list of log types that need to be enabled for exporting to Amazon CloudWatch Logs.</p>",
        "DBCluster$EnabledCloudwatchLogsExports": "<p>A list of log types that this DB cluster is configured to export to Amazon CloudWatch Logs.</p>",
        "DBEngineVersion$ExportableLogTypes": "<p>The types of logs that the database engine has available for export to Amazon CloudWatch Logs.</p>",
        "DBInstance$EnabledCloudwatchLogsExports": "<p>A list of log types that this DB instance is configured to export to Amazon CloudWatch Logs.</p>",
        "PendingCloudwatchLogsExports$LogTypesToEnable": "<p>Log types that are in the process of being deactivated. After they are deactivated, these log types aren't exported to CloudWatch Logs.</p>",
        "PendingCloudwatchLogsExports$LogTypesToDisable": "<p>Log types that are in the process of being enabled. After they are enabled, these log types are exported to Amazon CloudWatch Logs.</p>",
        "RestoreDBClusterFromSnapshotMessage$EnableCloudwatchLogsExports": "<p>A list of log types that must be enabled for exporting to Amazon CloudWatch Logs.</p>",
        "RestoreDBClusterToPointInTimeMessage$EnableCloudwatchLogsExports": "<p>A list of log types that must be enabled for exporting to Amazon CloudWatch Logs.</p>"
      }
    },
    "ModifyDBClusterMessage": {
      "base": "<p>Represents the input to <a>ModifyDBCluster</a>.</p>",
      "refs": {
      }
    },
    "ModifyDBClusterParameterGroupMessage": {
      "base": "<p>Represents the input to <a>ModifyDBClusterParameterGroup</a>.</p>",
      "refs": {
      }
    },
    "ModifyDBClusterResult": {
      "base": null,
      "refs": {
      }
    },
    "ModifyDBClusterSnapshotAttributeMessage": {
      "base": "<p>Represents the input to <a>ModifyDBClusterSnapshotAttribute</a>.</p>",
      "refs": {
      }
    },
    "ModifyDBClusterSnapshotAttributeResult": {
      "base": null,
      "refs": {
      }
    },
    "ModifyDBInstanceMessage": {
      "base": "<p>Represents the input to <a>ModifyDBInstance</a>.</p>",
      "refs": {
      }
    },
    "ModifyDBInstanceResult": {
      "base": null,
      "refs": {
      }
    },
    "ModifyDBSubnetGroupMessage": {
      "base": "<p>Represents the input to <a>ModifyDBSubnetGroup</a>.</p>",
      "refs": {
      }
    },
    "ModifyDBSubnetGroupResult": {
      "base": null,
      "refs": {
      }
    },
    "OrderableDBInstanceOption": {
      "base": "<p>The options that are available for a DB instance.</p>",
      "refs": {
        "OrderableDBInstanceOptionsList$member": null
      }
    },
    "OrderableDBInstanceOptionsList": {
      "base": null,
      "refs": {
        "OrderableDBInstanceOptionsMessage$OrderableDBInstanceOptions": "<p>The options that are available for a particular orderable DB instance.</p>"
      }
    },
    "OrderableDBInstanceOptionsMessage": {
      "base": "<p>Represents the output of <a>DescribeOrderableDBInstanceOptions</a>.</p>",
      "refs": {
      }
    },
    "Parameter": {
      "base": "<p>Detailed information about an individual parameter.</p>",
      "refs": {
        "ParametersList$member": null
      }
    },
    "ParametersList": {
      "base": null,
      "refs": {
        "DBClusterParameterGroupDetails$Parameters": "<p>Provides a list of parameters for the DB cluster parameter group.</p>",
        "EngineDefaults$Parameters": "<p>The parameters of a particular DB cluster parameter group family.</p>",
        "ModifyDBClusterParameterGroupMessage$Parameters": "<p>A list of parameters in the DB cluster parameter group to modify.</p>",
        "ResetDBClusterParameterGroupMessage$Parameters": "<p>A list of parameter names in the DB cluster parameter group to reset to the default values. You can't use this parameter if the <code>ResetAllParameters</code> parameter is set to <code>true</code>.</p>"
      }
    },
    "PendingCloudwatchLogsExports": {
      "base": "<p>A list of the log types whose configuration is still pending. These log types are in the process of being activated or deactivated.</p>",
      "refs": {
        "PendingModifiedValues$PendingCloudwatchLogsExports": "<p>A list of the log types whose configuration is still pending. These log types are in the process of being activated or deactivated.</p>"
      }
    },
    "PendingMaintenanceAction": {
      "base": "<p>Provides information about a pending maintenance action for a resource.</p>",
      "refs": {
        "PendingMaintenanceActionDetails$member": null
      }
    },
    "PendingMaintenanceActionDetails": {
      "base": null,
      "refs": {
        "ResourcePendingMaintenanceActions$PendingMaintenanceActionDetails": "<p>A list that provides details about the pending maintenance actions for the resource.</p>"
      }
    },
    "PendingMaintenanceActions": {
      "base": null,
      "refs": {
        "PendingMaintenanceActionsMessage$PendingMaintenanceActions": "<p>The maintenance actions to be applied.</p>"
      }
    },
    "PendingMaintenanceActionsMessage": {
      "base": "<p>Represents the output of <a>DescribePendingMaintenanceActions</a>.</p>",
      "refs": {
      }
    },
    "PendingModifiedValues": {
      "base": "<p> One or more modified settings for a DB instance. These modified settings have been requested, but haven't been applied yet.</p>",
      "refs": {
        "DBInstance$PendingModifiedValues": "<p>Specifies that changes to the DB instance are pending. This element is included only when changes are pending. Specific changes are identified by subelements.</p>"
      }
    },
    "RebootDBInstanceMessage": {
      "base": "<p>Represents the input to <a>RebootDBInstance</a>.</p>",
      "refs": {
      }
    },
    "RebootDBInstanceResult": {
      "base": null,
      "refs": {
      }
    },
    "RemoveTagsFromResourceMessage": {
      "base": "<p>Represents the input to <a>RemoveTagsFromResource</a>.</p>",
      "refs": {
      }
    },
    "ResetDBClusterParameterGroupMessage": {
      "base": "<p>Represents the input to <a>ResetDBClusterParameterGroup</a>.</p>",
      "refs": {
      }
    },
    "ResourceNotFoundFault": {
      "base": "<p>The specified resource ID was not found.</p>",
      "refs": {
      }
    },
    "ResourcePendingMaintenanceActions": {
      "base": "<p>Represents the output of <a>ApplyPendingMaintenanceAction</a>.</p>",
      "refs": {
        "ApplyPendingMaintenanceActionResult$ResourcePendingMaintenanceActions": null,
        "PendingMaintenanceActions$member": null
      }
    },
    "RestoreDBClusterFromSnapshotMessage": {
      "base": "<p>Represents the input to <a>RestoreDBClusterFromSnapshot</a>.</p>",
      "refs": {
      }
    },
    "RestoreDBClusterFromSnapshotResult": {
      "base": null,
      "refs": {
      }
    },
    "RestoreDBClusterToPointInTimeMessage": {
      "base": "<p>Represents the input to <a>RestoreDBClusterToPointInTime</a>.</p>",
      "refs": {
      }
    },
    "RestoreDBClusterToPointInTimeResult": {
      "base": null,
      "refs": {
      }
    },
    "SharedSnapshotQuotaExceededFault": {
      "base": "<p>You have exceeded the maximum number of accounts that you can share a manual DB snapshot with. </p>",
      "refs": {
      }
    },
    "SnapshotQuotaExceededFault": {
      "base": "<p>The request would cause you to exceed the allowed number of DB snapshots.</p>",
      "refs": {
      }
    },
    "SourceType": {
      "base": null,
      "refs": {
        "DescribeEventsMessage$SourceType": "<p>The event source to retrieve events for. If no value is specified, all events are returned.</p>",
        "Event$SourceType": "<p>Specifies the source type for this event.</p>"
      }
    },
    "StartDBClusterMessage": {
      "base": null,
      "refs": {
      }
    },
    "StartDBClusterResult": {
      "base": null,
      "refs": {
      }
    },
    "StopDBClusterMessage": {
      "base": null,
      "refs": {
      }
    },
    "StopDBClusterResult": {
      "base": null,
      "refs": {
      }
    },
    "StorageQuotaExceededFault": {
      "base": "<p>The request would cause you to exceed the allowed amount of storage available across all DB instances.</p>",
      "refs": {
      }
    },
    "StorageTypeNotSupportedFault": {
      "base": "<p>Storage of the specified <code>StorageType</code> can't be associated with the DB instance. </p>",
      "refs": {
      }
    },
    "String": {
      "base": null,
      "refs": {
        "AddTagsToResourceMessage$ResourceName": "<p>The Amazon DocumentDB resource that the tags are added to. This value is an Amazon Resource Name (ARN).</p>",
        "ApplyPendingMaintenanceActionMessage$ResourceIdentifier": "<p>The Amazon Resource Name (ARN) of the resource that the pending maintenance action applies to.</p>",
        "ApplyPendingMaintenanceActionMessage$ApplyAction": "<p>The pending maintenance action to apply to this resource.</p> <p>Valid values: <code>system-update</code>, <code>db-upgrade</code> </p>",
        "ApplyPendingMaintenanceActionMessage$OptInType": "<p>A value that specifies the type of opt-in request or undoes an opt-in request. An opt-in request of type <code>immediate</code> can't be undone.</p> <p>Valid values:</p> <ul> <li> <p> <code>immediate</code> - Apply the maintenance action immediately.</p> </li> <li> <p> <code>next-maintenance</code> - Apply the maintenance action during the next maintenance window for the resource.</p> </li> <li> <p> <code>undo-opt-in</code> - Cancel any existing <code>next-maintenance</code> opt-in requests.</p> </li> </ul>",
        "AttributeValueList$member": null,
        "AvailabilityZone$Name": "<p>The name of the Availability Zone.</p>",
        "AvailabilityZones$member": null,
        "Certificate$CertificateIdentifier": "<p>The unique key that identifies a certificate.</p> <p>Example: <code>rds-ca-2019</code> </p>",
        "Certificate$CertificateType": "<p>The type of the certificate.</p> <p>Example: <code>CA</code> </p>",
        "Certificate$Thumbprint": "<p>The thumbprint of the certificate.</p>",
        "Certificate$CertificateArn": "<p>The Amazon Resource Name (ARN) for the certificate.</p> <p>Example: <code>arn:aws:rds:us-east-1::cert:rds-ca-2019</code> </p>",
        "CertificateMessage$Marker": "<p>An optional pagination token provided if the number of records retrieved is greater than <code>MaxRecords</code>. If this parameter is specified, the marker specifies the next record in the list. Including the value of <code>Marker</code> in the next call to <code>DescribeCertificates</code> results in the next page of certificates.</p>",
        "CopyDBClusterParameterGroupMessage$SourceDBClusterParameterGroupIdentifier": "<p>The identifier or Amazon Resource Name (ARN) for the source DB cluster parameter group.</p> <p>Constraints:</p> <ul> <li> <p>Must specify a valid DB cluster parameter group.</p> </li> <li> <p>If the source DB cluster parameter group is in the same AWS Region as the copy, specify a valid DB parameter group identifier; for example, <code>my-db-cluster-param-group</code>, or a valid ARN.</p> </li> <li> <p>If the source DB parameter group is in a different AWS Region than the copy, specify a valid DB cluster parameter group ARN; for example, <code>arn:aws:rds:us-east-1:123456789012:cluster-pg:custom-cluster-group1</code>.</p> </li> </ul>",
        "CopyDBClusterParameterGroupMessage$TargetDBClusterParameterGroupIdentifier": "<p>The identifier for the copied DB cluster parameter group.</p> <p>Constraints:</p> <ul> <li> <p>Cannot be null, empty, or blank.</p> </li> <li> <p>Must contain from 1 to 255 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul> <p>Example: <code>my-cluster-param-group1</code> </p>",
        "CopyDBClusterParameterGroupMessage$TargetDBClusterParameterGroupDescription": "<p>A description for the copied DB cluster parameter group.</p>",
        "CopyDBClusterSnapshotMessage$SourceDBClusterSnapshotIdentifier": "<p>The identifier of the DB cluster snapshot to copy. This parameter is not case sensitive.</p> <p>You can't copy an encrypted, shared DB cluster snapshot from one AWS Region to another.</p> <p>Constraints:</p> <ul> <li> <p>Must specify a valid system snapshot in the \"available\" state.</p> </li> <li> <p>If the source snapshot is in the same AWS Region as the copy, specify a valid DB snapshot identifier.</p> </li> <li> <p>If the source snapshot is in a different AWS Region than the copy, specify a valid DB cluster snapshot ARN.</p> </li> </ul> <p>Example: <code>my-cluster-snapshot1</code> </p>",
        "CopyDBClusterSnapshotMessage$TargetDBClusterSnapshotIdentifier": "<p>The identifier of the new DB cluster snapshot to create from the source DB cluster snapshot. This parameter is not case sensitive.</p> <p>Constraints:</p> <ul> <li> <p>Must contain from 1 to 63 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul> <p>Example: <code>my-cluster-snapshot2</code> </p>",
        "CopyDBClusterSnapshotMessage$KmsKeyId": "<p>The AWS KMS key ID for an encrypted DB cluster snapshot. The AWS KMS key ID is the Amazon Resource Name (ARN), AWS KMS key identifier, or the AWS KMS key alias for the AWS KMS encryption key. </p> <p>If you copy an encrypted DB cluster snapshot from your AWS account, you can specify a value for <code>KmsKeyId</code> to encrypt the copy with a new AWS KMS encryption key. If you don't specify a value for <code>KmsKeyId</code>, then the copy of the DB cluster snapshot is encrypted with the same AWS KMS key as the source DB cluster snapshot. </p> <p>If you copy an encrypted DB cluster snapshot that is shared from another AWS account, then you must specify a value for <code>KmsKeyId</code>. </p> <p>To copy an encrypted DB cluster snapshot to another AWS Region, set <code>KmsKeyId</code> to the AWS KMS key ID that you want to use to encrypt the copy of the DB cluster snapshot in the destination Region. AWS KMS encryption keys are specific to the AWS Region that they are created in, and you can't use encryption keys from one Region in another Region.</p> <p>If you copy an unencrypted DB cluster snapshot and specify a value for the <code>KmsKeyId</code> parameter, an error is returned.</p>",
        "CopyDBClusterSnapshotMessage$PreSignedUrl": "<p>The URL that contains a Signature Version 4 signed request for the <code>CopyDBClusterSnapshot</code> API action in the AWS Region that contains the source DB cluster snapshot to copy. You must use the <code>PreSignedUrl</code> parameter when copying an encrypted DB cluster snapshot from another AWS Region.</p> <p>The presigned URL must be a valid request for the <code>CopyDBSClusterSnapshot</code> API action that can be executed in the source AWS Region that contains the encrypted DB cluster snapshot to be copied. The presigned URL request must contain the following parameter values:</p> <ul> <li> <p> <code>KmsKeyId</code> - The AWS KMS key identifier for the key to use to encrypt the copy of the DB cluster snapshot in the destination AWS Region. This is the same identifier for both the <code>CopyDBClusterSnapshot</code> action that is called in the destination AWS Region, and the action contained in the presigned URL.</p> </li> <li> <p> <code>DestinationRegion</code> - The name of the AWS Region that the DB cluster snapshot will be created in.</p> </li> <li> <p> <code>SourceDBClusterSnapshotIdentifier</code> - The DB cluster snapshot identifier for the encrypted DB cluster snapshot to be copied. This identifier must be in the Amazon Resource Name (ARN) format for the source AWS Region. For example, if you are copying an encrypted DB cluster snapshot from the us-west-2 AWS Region, then your <code>SourceDBClusterSnapshotIdentifier</code> looks like the following example: <code>arn:aws:rds:us-west-2:123456789012:cluster-snapshot:my-cluster-snapshot-20161115</code>.</p> </li> </ul>",
        "CreateDBClusterMessage$DBClusterIdentifier": "<p>The DB cluster identifier. This parameter is stored as a lowercase string.</p> <p>Constraints:</p> <ul> <li> <p>Must contain from 1 to 63 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul> <p>Example: <code>my-cluster</code> </p>",
        "CreateDBClusterMessage$DBClusterParameterGroupName": "<p> The name of the DB cluster parameter group to associate with this DB cluster.</p>",
        "CreateDBClusterMessage$DBSubnetGroupName": "<p>A DB subnet group to associate with this DB cluster.</p> <p>Constraints: Must match the name of an existing <code>DBSubnetGroup</code>. Must not be default.</p> <p>Example: <code>mySubnetgroup</code> </p>",
        "CreateDBClusterMessage$Engine": "<p>The name of the database engine to be used for this DB cluster.</p> <p>Valid values: <code>docdb</code> </p>",
        "CreateDBClusterMessage$EngineVersion": "<p>The version number of the database engine to use.</p>",
        "CreateDBClusterMessage$MasterUsername": "<p>The name of the master user for the DB cluster.</p> <p>Constraints:</p> <ul> <li> <p>Must be from 1 to 63 letters or numbers.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot be a reserved word for the chosen database engine.</p> </li> </ul>",
        "CreateDBClusterMessage$MasterUserPassword": "<p>The password for the master database user. This password can contain any printable ASCII character except forward slash (/), double quote (\"), or the \"at\" symbol (@).</p> <p>Constraints: Must contain from 8 to 100 characters.</p>",
        "CreateDBClusterMessage$PreferredBackupWindow": "<p>The daily time range during which automated backups are created if automated backups are enabled using the <code>BackupRetentionPeriod</code> parameter. </p> <p>The default is a 30-minute window selected at random from an 8-hour block of time for each AWS Region. </p> <p>Constraints:</p> <ul> <li> <p>Must be in the format <code>hh24:mi-hh24:mi</code>.</p> </li> <li> <p>Must be in Universal Coordinated Time (UTC).</p> </li> <li> <p>Must not conflict with the preferred maintenance window.</p> </li> <li> <p>Must be at least 30 minutes.</p> </li> </ul>",
        "CreateDBClusterMessage$PreferredMaintenanceWindow": "<p>The weekly time range during which system maintenance can occur, in Universal Coordinated Time (UTC).</p> <p>Format: <code>ddd:hh24:mi-ddd:hh24:mi</code> </p> <p>The default is a 30-minute window selected at random from an 8-hour block of time for each AWS Region, occurring on a random day of the week.</p> <p>Valid days: Mon, Tue, Wed, Thu, Fri, Sat, Sun</p> <p>Constraints: Minimum 30-minute window.</p>",
        "CreateDBClusterMessage$KmsKeyId": "<p>The AWS KMS key identifier for an encrypted DB cluster.</p> <p>The AWS KMS key identifier is the Amazon Resource Name (ARN) for the AWS KMS encryption key. If you are creating a DB cluster using the same AWS account that owns the AWS KMS encryption key that is used to encrypt the new DB cluster, you can use the AWS KMS key alias instead of the ARN for the AWS KMS encryption key.</p> <p>If an encryption key is not specified in <code>KmsKeyId</code>:</p> <ul> <li> <p>If <code>ReplicationSourceIdentifier</code> identifies an encrypted source, then Amazon DocumentDB uses the encryption key that is used to encrypt the source. Otherwise, Amazon DocumentDB uses your default encryption key. </p> </li> <li> <p>If the <code>StorageEncrypted</code> parameter is <code>true</code> and <code>ReplicationSourceIdentifier</code> is not specified, Amazon DocumentDB uses your default encryption key.</p> </li> </ul> <p>AWS KMS creates the default encryption key for your AWS account. Your AWS account has a different default encryption key for each AWS Region.</p> <p>If you create a replica of an encrypted DB cluster in another AWS Region, you must set <code>KmsKeyId</code> to a KMS key ID that is valid in the destination AWS Region. This key is used to encrypt the replica in that AWS Region.</p>",
        "CreateDBClusterParameterGroupMessage$DBClusterParameterGroupName": "<p>The name of the DB cluster parameter group.</p> <p>Constraints:</p> <ul> <li> <p>Must match the name of an existing <code>DBClusterParameterGroup</code>.</p> </li> </ul> <note> <p>This value is stored as a lowercase string.</p> </note>",
        "CreateDBClusterParameterGroupMessage$DBParameterGroupFamily": "<p>The DB cluster parameter group family name.</p>",
        "CreateDBClusterParameterGroupMessage$Description": "<p>The description for the DB cluster parameter group.</p>",
        "CreateDBClusterSnapshotMessage$DBClusterSnapshotIdentifier": "<p>The identifier of the DB cluster snapshot. This parameter is stored as a lowercase string.</p> <p>Constraints:</p> <ul> <li> <p>Must contain from 1 to 63 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul> <p>Example: <code>my-cluster-snapshot1</code> </p>",
        "CreateDBClusterSnapshotMessage$DBClusterIdentifier": "<p>The identifier of the DB cluster to create a snapshot for. This parameter is not case sensitive.</p> <p>Constraints:</p> <ul> <li> <p>Must match the identifier of an existing <code>DBCluster</code>.</p> </li> </ul> <p>Example: <code>my-cluster</code> </p>",
        "CreateDBInstanceMessage$DBInstanceIdentifier": "<p>The DB instance identifier. This parameter is stored as a lowercase string.</p> <p>Constraints:</p> <ul> <li> <p>Must contain from 1 to 63 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul> <p>Example: <code>mydbinstance</code> </p>",
        "CreateDBInstanceMessage$DBInstanceClass": "<p>The compute and memory capacity of the DB instance; for example, <code>db.r5.large</code>. </p>",
        "CreateDBInstanceMessage$Engine": "<p>The name of the database engine to be used for this instance.</p> <p>Valid value: <code>docdb</code> </p>",
        "CreateDBInstanceMessage$AvailabilityZone": "<p> The Amazon EC2 Availability Zone that the DB instance is created in.</p> <p>Default: A random, system-chosen Availability Zone in the endpoint's AWS Region.</p> <p> Example: <code>us-east-1d</code> </p> <p> Constraint: The <code>AvailabilityZone</code> parameter can't be specified if the <code>MultiAZ</code> parameter is set to <code>true</code>. The specified Availability Zone must be in the same AWS Region as the current endpoint. </p>",
        "CreateDBInstanceMessage$PreferredMaintenanceWindow": "<p>The time range each week during which system maintenance can occur, in Universal Coordinated Time (UTC).</p> <p> Format: <code>ddd:hh24:mi-ddd:hh24:mi</code> </p> <p>The default is a 30-minute window selected at random from an 8-hour block of time for each AWS Region, occurring on a random day of the week. </p> <p>Valid days: Mon, Tue, Wed, Thu, Fri, Sat, Sun</p> <p>Constraints: Minimum 30-minute window.</p>",
        "CreateDBInstanceMessage$DBClusterIdentifier": "<p>The identifier of the DB cluster that the instance will belong to.</p>",
        "CreateDBSubnetGroupMessage$DBSubnetGroupName": "<p>The name for the DB subnet group. This value is stored as a lowercase string.</p> <p>Constraints: Must contain no more than 255 letters, numbers, periods, underscores, spaces, or hyphens. Must not be default.</p> <p>Example: <code>mySubnetgroup</code> </p>",
        "CreateDBSubnetGroupMessage$DBSubnetGroupDescription": "<p>The description for the DB subnet group.</p>",
        "DBCluster$DBClusterIdentifier": "<p>Contains a user-supplied DB cluster identifier. This identifier is the unique key that identifies a DB cluster.</p>",
        "DBCluster$DBClusterParameterGroup": "<p>Specifies the name of the DB cluster parameter group for the DB cluster.</p>",
        "DBCluster$DBSubnetGroup": "<p>Specifies information on the subnet group that is associated with the DB cluster, including the name, description, and subnets in the subnet group.</p>",
        "DBCluster$Status": "<p>Specifies the current state of this DB cluster.</p>",
        "DBCluster$PercentProgress": "<p>Specifies the progress of the operation as a percentage.</p>",
        "DBCluster$Endpoint": "<p>Specifies the connection endpoint for the primary instance of the DB cluster.</p>",
        "DBCluster$ReaderEndpoint": "<p>The reader endpoint for the DB cluster. The reader endpoint for a DB cluster load balances connections across the Amazon DocumentDB replicas that are available in a DB cluster. As clients request new connections to the reader endpoint, Amazon DocumentDB distributes the connection requests among the Amazon DocumentDB replicas in the DB cluster. This functionality can help balance your read workload across multiple Amazon DocumentDB replicas in your DB cluster. </p> <p>If a failover occurs, and the Amazon DocumentDB replica that you are connected to is promoted to be the primary instance, your connection is dropped. To continue sending your read workload to other Amazon DocumentDB replicas in the cluster, you can then reconnect to the reader endpoint.</p>",
        "DBCluster$Engine": "<p>Provides the name of the database engine to be used for this DB cluster.</p>",
        "DBCluster$EngineVersion": "<p>Indicates the database engine version.</p>",
        "DBCluster$MasterUsername": "<p>Contains the master user name for the DB cluster.</p>",
        "DBCluster$PreferredBackupWindow": "<p>Specifies the daily time range during which automated backups are created if automated backups are enabled, as determined by the <code>BackupRetentionPeriod</code>. </p>",
        "DBCluster$PreferredMaintenanceWindow": "<p>Specifies the weekly time range during which system maintenance can occur, in Universal Coordinated Time (UTC).</p>",
        "DBCluster$HostedZoneId": "<p>Specifies the ID that Amazon Route 53 assigns when you create a hosted zone.</p>",
        "DBCluster$KmsKeyId": "<p>If <code>StorageEncrypted</code> is <code>true</code>, the AWS KMS key identifier for the encrypted DB cluster.</p>",
        "DBCluster$DbClusterResourceId": "<p>The AWS Region-unique, immutable identifier for the DB cluster. This identifier is found in AWS CloudTrail log entries whenever the AWS KMS key for the DB cluster is accessed.</p>",
        "DBCluster$DBClusterArn": "<p>The Amazon Resource Name (ARN) for the DB cluster.</p>",
        "DBClusterMember$DBInstanceIdentifier": "<p>Specifies the instance identifier for this member of the DB cluster.</p>",
        "DBClusterMember$DBClusterParameterGroupStatus": "<p>Specifies the status of the DB cluster parameter group for this member of the DB cluster.</p>",
        "DBClusterMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DBClusterParameterGroup$DBClusterParameterGroupName": "<p>Provides the name of the DB cluster parameter group.</p>",
        "DBClusterParameterGroup$DBParameterGroupFamily": "<p>Provides the name of the DB parameter group family that this DB cluster parameter group is compatible with.</p>",
        "DBClusterParameterGroup$Description": "<p>Provides the customer-specified description for this DB cluster parameter group.</p>",
        "DBClusterParameterGroup$DBClusterParameterGroupArn": "<p>The Amazon Resource Name (ARN) for the DB cluster parameter group.</p>",
        "DBClusterParameterGroupDetails$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DBClusterParameterGroupNameMessage$DBClusterParameterGroupName": "<p>The name of a DB cluster parameter group.</p> <p>Constraints:</p> <ul> <li> <p>Must be from 1 to 255 letters or numbers.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul> <note> <p>This value is stored as a lowercase string.</p> </note>",
        "DBClusterParameterGroupsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DBClusterRole$RoleArn": "<p>The Amazon Resource Name (ARN) of the IAM role that is associated with the DB cluster.</p>",
        "DBClusterRole$Status": "<p>Describes the state of association between the IAM role and the DB cluster. The <code>Status</code> property returns one of the following values:</p> <ul> <li> <p> <code>ACTIVE</code> - The IAM role ARN is associated with the DB cluster and can be used to access other AWS services on your behalf.</p> </li> <li> <p> <code>PENDING</code> - The IAM role ARN is being associated with the DB cluster.</p> </li> <li> <p> <code>INVALID</code> - The IAM role ARN is associated with the DB cluster, but the DB cluster cannot assume the IAM role to access other AWS services on your behalf.</p> </li> </ul>",
        "DBClusterSnapshot$DBClusterSnapshotIdentifier": "<p>Specifies the identifier for the DB cluster snapshot.</p>",
        "DBClusterSnapshot$DBClusterIdentifier": "<p>Specifies the DB cluster identifier of the DB cluster that this DB cluster snapshot was created from.</p>",
        "DBClusterSnapshot$Engine": "<p>Specifies the name of the database engine.</p>",
        "DBClusterSnapshot$Status": "<p>Specifies the status of this DB cluster snapshot.</p>",
        "DBClusterSnapshot$VpcId": "<p>Provides the virtual private cloud (VPC) ID that is associated with the DB cluster snapshot.</p>",
        "DBClusterSnapshot$MasterUsername": "<p>Provides the master user name for the DB cluster snapshot.</p>",
        "DBClusterSnapshot$EngineVersion": "<p>Provides the version of the database engine for this DB cluster snapshot.</p>",
        "DBClusterSnapshot$SnapshotType": "<p>Provides the type of the DB cluster snapshot.</p>",
        "DBClusterSnapshot$KmsKeyId": "<p>If <code>StorageEncrypted</code> is <code>true</code>, the AWS KMS key identifier for the encrypted DB cluster snapshot.</p>",
        "DBClusterSnapshot$DBClusterSnapshotArn": "<p>The Amazon Resource Name (ARN) for the DB cluster snapshot.</p>",
        "DBClusterSnapshot$SourceDBClusterSnapshotArn": "<p>If the DB cluster snapshot was copied from a source DB cluster snapshot, the ARN for the source DB cluster snapshot; otherwise, a null value.</p>",
        "DBClusterSnapshotAttribute$AttributeName": "<p>The name of the manual DB cluster snapshot attribute.</p> <p>The attribute named <code>restore</code> refers to the list of AWS accounts that have permission to copy or restore the manual DB cluster snapshot.</p>",
        "DBClusterSnapshotAttributesResult$DBClusterSnapshotIdentifier": "<p>The identifier of the DB cluster snapshot that the attributes apply to.</p>",
        "DBClusterSnapshotMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DBEngineVersion$Engine": "<p>The name of the database engine.</p>",
        "DBEngineVersion$EngineVersion": "<p>The version number of the database engine.</p>",
        "DBEngineVersion$DBParameterGroupFamily": "<p>The name of the DB parameter group family for the database engine.</p>",
        "DBEngineVersion$DBEngineDescription": "<p>The description of the database engine.</p>",
        "DBEngineVersion$DBEngineVersionDescription": "<p>The description of the database engine version.</p>",
        "DBEngineVersionMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DBInstance$DBInstanceIdentifier": "<p>Contains a user-provided database identifier. This identifier is the unique key that identifies a DB instance.</p>",
        "DBInstance$DBInstanceClass": "<p>Contains the name of the compute and memory capacity class of the DB instance.</p>",
        "DBInstance$Engine": "<p>Provides the name of the database engine to be used for this DB instance.</p>",
        "DBInstance$DBInstanceStatus": "<p>Specifies the current state of this database.</p>",
        "DBInstance$PreferredBackupWindow": "<p> Specifies the daily time range during which automated backups are created if automated backups are enabled, as determined by the <code>BackupRetentionPeriod</code>. </p>",
        "DBInstance$AvailabilityZone": "<p>Specifies the name of the Availability Zone that the DB instance is located in.</p>",
        "DBInstance$PreferredMaintenanceWindow": "<p>Specifies the weekly time range during which system maintenance can occur, in Universal Coordinated Time (UTC).</p>",
        "DBInstance$EngineVersion": "<p>Indicates the database engine version.</p>",
        "DBInstance$DBClusterIdentifier": "<p>Contains the name of the DB cluster that the DB instance is a member of if the DB instance is a member of a DB cluster.</p>",
        "DBInstance$KmsKeyId": "<p> If <code>StorageEncrypted</code> is <code>true</code>, the AWS KMS key identifier for the encrypted DB instance. </p>",
        "DBInstance$DbiResourceId": "<p>The AWS Region-unique, immutable identifier for the DB instance. This identifier is found in AWS CloudTrail log entries whenever the AWS KMS key for the DB instance is accessed.</p>",
        "DBInstance$CACertificateIdentifier": "<p>The identifier of the CA certificate for this DB instance.</p>",
        "DBInstance$DBInstanceArn": "<p>The Amazon Resource Name (ARN) for the DB instance.</p>",
        "DBInstanceMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DBInstanceStatusInfo$StatusType": "<p>This value is currently \"<code>read replication</code>.\"</p>",
        "DBInstanceStatusInfo$Status": "<p>Status of the DB instance. For a <code>StatusType</code> of read replica, the values can be <code>replicating</code>, error, <code>stopped</code>, or <code>terminated</code>.</p>",
        "DBInstanceStatusInfo$Message": "<p>Details of the error if there is an error for the instance. If the instance is not in an error state, this value is blank.</p>",
        "DBSubnetGroup$DBSubnetGroupName": "<p>The name of the DB subnet group.</p>",
        "DBSubnetGroup$DBSubnetGroupDescription": "<p>Provides the description of the DB subnet group.</p>",
        "DBSubnetGroup$VpcId": "<p>Provides the virtual private cloud (VPC) ID of the DB subnet group.</p>",
        "DBSubnetGroup$SubnetGroupStatus": "<p>Provides the status of the DB subnet group.</p>",
        "DBSubnetGroup$DBSubnetGroupArn": "<p>The Amazon Resource Name (ARN) for the DB subnet group.</p>",
        "DBSubnetGroupMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DeleteDBClusterMessage$DBClusterIdentifier": "<p>The DB cluster identifier for the DB cluster to be deleted. This parameter isn't case sensitive.</p> <p>Constraints:</p> <ul> <li> <p>Must match an existing <code>DBClusterIdentifier</code>.</p> </li> </ul>",
        "DeleteDBClusterMessage$FinalDBSnapshotIdentifier": "<p> The DB cluster snapshot identifier of the new DB cluster snapshot created when <code>SkipFinalSnapshot</code> is set to <code>false</code>. </p> <note> <p> Specifying this parameter and also setting the <code>SkipFinalShapshot</code> parameter to <code>true</code> results in an error. </p> </note> <p>Constraints:</p> <ul> <li> <p>Must be from 1 to 255 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul>",
        "DeleteDBClusterParameterGroupMessage$DBClusterParameterGroupName": "<p>The name of the DB cluster parameter group.</p> <p>Constraints:</p> <ul> <li> <p>Must be the name of an existing DB cluster parameter group.</p> </li> <li> <p>You can't delete a default DB cluster parameter group.</p> </li> <li> <p>Cannot be associated with any DB clusters.</p> </li> </ul>",
        "DeleteDBClusterSnapshotMessage$DBClusterSnapshotIdentifier": "<p>The identifier of the DB cluster snapshot to delete.</p> <p>Constraints: Must be the name of an existing DB cluster snapshot in the <code>available</code> state.</p>",
        "DeleteDBInstanceMessage$DBInstanceIdentifier": "<p>The DB instance identifier for the DB instance to be deleted. This parameter isn't case sensitive.</p> <p>Constraints:</p> <ul> <li> <p>Must match the name of an existing DB instance.</p> </li> </ul>",
        "DeleteDBSubnetGroupMessage$DBSubnetGroupName": "<p>The name of the database subnet group to delete.</p> <note> <p>You can't delete the default subnet group.</p> </note> <p>Constraints:</p> <p>Must match the name of an existing <code>DBSubnetGroup</code>. Must not be default.</p> <p>Example: <code>mySubnetgroup</code> </p>",
        "DescribeCertificatesMessage$CertificateIdentifier": "<p>The user-supplied certificate identifier. If this parameter is specified, information for only the specified certificate is returned. If this parameter is omitted, a list of up to <code>MaxRecords</code> certificates is returned. This parameter is not case sensitive.</p> <p>Constraints</p> <ul> <li> <p>Must match an existing <code>CertificateIdentifier</code>.</p> </li> </ul>",
        "DescribeCertificatesMessage$Marker": "<p>An optional pagination token provided by a previous <code>DescribeCertificates</code> request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeDBClusterParameterGroupsMessage$DBClusterParameterGroupName": "<p>The name of a specific DB cluster parameter group to return details for.</p> <p>Constraints:</p> <ul> <li> <p>If provided, must match the name of an existing <code>DBClusterParameterGroup</code>.</p> </li> </ul>",
        "DescribeDBClusterParameterGroupsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeDBClusterParametersMessage$DBClusterParameterGroupName": "<p>The name of a specific DB cluster parameter group to return parameter details for.</p> <p>Constraints:</p> <ul> <li> <p>If provided, must match the name of an existing <code>DBClusterParameterGroup</code>.</p> </li> </ul>",
        "DescribeDBClusterParametersMessage$Source": "<p> A value that indicates to return only parameters for a specific source. Parameter sources can be <code>engine</code>, <code>service</code>, or <code>customer</code>. </p>",
        "DescribeDBClusterParametersMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeDBClusterSnapshotAttributesMessage$DBClusterSnapshotIdentifier": "<p>The identifier for the DB cluster snapshot to describe the attributes for.</p>",
        "DescribeDBClusterSnapshotsMessage$DBClusterIdentifier": "<p>The ID of the DB cluster to retrieve the list of DB cluster snapshots for. This parameter can't be used with the <code>DBClusterSnapshotIdentifier</code> parameter. This parameter is not case sensitive. </p> <p>Constraints:</p> <ul> <li> <p>If provided, must match the identifier of an existing <code>DBCluster</code>.</p> </li> </ul>",
        "DescribeDBClusterSnapshotsMessage$DBClusterSnapshotIdentifier": "<p>A specific DB cluster snapshot identifier to describe. This parameter can't be used with the <code>DBClusterIdentifier</code> parameter. This value is stored as a lowercase string. </p> <p>Constraints:</p> <ul> <li> <p>If provided, must match the identifier of an existing <code>DBClusterSnapshot</code>.</p> </li> <li> <p>If this identifier is for an automated snapshot, the <code>SnapshotType</code> parameter must also be specified.</p> </li> </ul>",
        "DescribeDBClusterSnapshotsMessage$SnapshotType": "<p>The type of DB cluster snapshots to be returned. You can specify one of the following values:</p> <ul> <li> <p> <code>automated</code> - Return all DB cluster snapshots that Amazon DocumentDB has automatically created for your AWS account.</p> </li> <li> <p> <code>manual</code> - Return all DB cluster snapshots that you have manually created for your AWS account.</p> </li> <li> <p> <code>shared</code> - Return all manual DB cluster snapshots that have been shared to your AWS account.</p> </li> <li> <p> <code>public</code> - Return all DB cluster snapshots that have been marked as public.</p> </li> </ul> <p>If you don't specify a <code>SnapshotType</code> value, then both automated and manual DB cluster snapshots are returned. You can include shared DB cluster snapshots with these results by setting the <code>IncludeShared</code> parameter to <code>true</code>. You can include public DB cluster snapshots with these results by setting the <code>IncludePublic</code> parameter to <code>true</code>.</p> <p>The <code>IncludeShared</code> and <code>IncludePublic</code> parameters don't apply for <code>SnapshotType</code> values of <code>manual</code> or <code>automated</code>. The <code>IncludePublic</code> parameter doesn't apply when <code>SnapshotType</code> is set to <code>shared</code>. The <code>IncludeShared</code> parameter doesn't apply when <code>SnapshotType</code> is set to <code>public</code>.</p>",
        "DescribeDBClusterSnapshotsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeDBClustersMessage$DBClusterIdentifier": "<p>The user-provided DB cluster identifier. If this parameter is specified, information from only the specific DB cluster is returned. This parameter isn't case sensitive.</p> <p>Constraints:</p> <ul> <li> <p>If provided, must match an existing <code>DBClusterIdentifier</code>.</p> </li> </ul>",
        "DescribeDBClustersMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeDBEngineVersionsMessage$Engine": "<p>The database engine to return.</p>",
        "DescribeDBEngineVersionsMessage$EngineVersion": "<p>The database engine version to return.</p> <p>Example: <code>5.1.49</code> </p>",
        "DescribeDBEngineVersionsMessage$DBParameterGroupFamily": "<p>The name of a specific DB parameter group family to return details for.</p> <p>Constraints:</p> <ul> <li> <p>If provided, must match an existing <code>DBParameterGroupFamily</code>.</p> </li> </ul>",
        "DescribeDBEngineVersionsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeDBInstancesMessage$DBInstanceIdentifier": "<p>The user-provided instance identifier. If this parameter is specified, information from only the specific DB instance is returned. This parameter isn't case sensitive.</p> <p>Constraints:</p> <ul> <li> <p>If provided, must match the identifier of an existing <code>DBInstance</code>.</p> </li> </ul>",
        "DescribeDBInstancesMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeDBSubnetGroupsMessage$DBSubnetGroupName": "<p>The name of the DB subnet group to return details for.</p>",
        "DescribeDBSubnetGroupsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeEngineDefaultClusterParametersMessage$DBParameterGroupFamily": "<p>The name of the DB cluster parameter group family to return the engine parameter information for.</p>",
        "DescribeEngineDefaultClusterParametersMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeEventCategoriesMessage$SourceType": "<p>The type of source that is generating the events.</p> <p>Valid values: <code>db-instance</code>, <code>db-parameter-group</code>, <code>db-security-group</code>, <code>db-snapshot</code> </p>",
        "DescribeEventsMessage$SourceIdentifier": "<p>The identifier of the event source for which events are returned. If not specified, then all sources are included in the response.</p> <p>Constraints:</p> <ul> <li> <p>If <code>SourceIdentifier</code> is provided, <code>SourceType</code> must also be provided.</p> </li> <li> <p>If the source type is <code>DBInstance</code>, a <code>DBInstanceIdentifier</code> must be provided.</p> </li> <li> <p>If the source type is <code>DBSecurityGroup</code>, a <code>DBSecurityGroupName</code> must be provided.</p> </li> <li> <p>If the source type is <code>DBParameterGroup</code>, a <code>DBParameterGroupName</code> must be provided.</p> </li> <li> <p>If the source type is <code>DBSnapshot</code>, a <code>DBSnapshotIdentifier</code> must be provided.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul>",
        "DescribeEventsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribeOrderableDBInstanceOptionsMessage$Engine": "<p>The name of the engine to retrieve DB instance options for.</p>",
        "DescribeOrderableDBInstanceOptionsMessage$EngineVersion": "<p>The engine version filter value. Specify this parameter to show only the available offerings that match the specified engine version.</p>",
        "DescribeOrderableDBInstanceOptionsMessage$DBInstanceClass": "<p>The DB instance class filter value. Specify this parameter to show only the available offerings that match the specified DB instance class.</p>",
        "DescribeOrderableDBInstanceOptionsMessage$LicenseModel": "<p>The license model filter value. Specify this parameter to show only the available offerings that match the specified license model.</p>",
        "DescribeOrderableDBInstanceOptionsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "DescribePendingMaintenanceActionsMessage$ResourceIdentifier": "<p>The ARN of a resource to return pending maintenance actions for.</p>",
        "DescribePendingMaintenanceActionsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "Endpoint$Address": "<p>Specifies the DNS address of the DB instance.</p>",
        "Endpoint$HostedZoneId": "<p>Specifies the ID that Amazon Route 53 assigns when you create a hosted zone.</p>",
        "EngineDefaults$DBParameterGroupFamily": "<p>The name of the DB cluster parameter group family to return the engine parameter information for.</p>",
        "EngineDefaults$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "Event$SourceIdentifier": "<p>Provides the identifier for the source of the event.</p>",
        "Event$Message": "<p>Provides the text of this event.</p>",
        "Event$SourceArn": "<p>The Amazon Resource Name (ARN) for the event.</p>",
        "EventCategoriesList$member": null,
        "EventCategoriesMap$SourceType": "<p>The source type that the returned categories belong to.</p>",
        "EventsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "FailoverDBClusterMessage$DBClusterIdentifier": "<p>A DB cluster identifier to force a failover for. This parameter is not case sensitive.</p> <p>Constraints:</p> <ul> <li> <p>Must match the identifier of an existing <code>DBCluster</code>.</p> </li> </ul>",
        "FailoverDBClusterMessage$TargetDBInstanceIdentifier": "<p>The name of the instance to promote to the primary instance.</p> <p>You must specify the instance identifier for an Amazon DocumentDB replica in the DB cluster. For example, <code>mydbcluster-replica1</code>.</p>",
        "Filter$Name": "<p>The name of the filter. Filter names are case sensitive.</p>",
        "FilterValueList$member": null,
        "KeyList$member": null,
        "ListTagsForResourceMessage$ResourceName": "<p>The Amazon DocumentDB resource with tags to be listed. This value is an Amazon Resource Name (ARN).</p>",
        "LogTypeList$member": null,
        "ModifyDBClusterMessage$DBClusterIdentifier": "<p>The DB cluster identifier for the cluster that is being modified. This parameter is not case sensitive.</p> <p>Constraints:</p> <ul> <li> <p>Must match the identifier of an existing <code>DBCluster</code>.</p> </li> </ul>",
        "ModifyDBClusterMessage$NewDBClusterIdentifier": "<p>The new DB cluster identifier for the DB cluster when renaming a DB cluster. This value is stored as a lowercase string.</p> <p>Constraints:</p> <ul> <li> <p>Must contain from 1 to 63 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul> <p>Example: <code>my-cluster2</code> </p>",
        "ModifyDBClusterMessage$DBClusterParameterGroupName": "<p>The name of the DB cluster parameter group to use for the DB cluster.</p>",
        "ModifyDBClusterMessage$MasterUserPassword": "<p>The password for the master database user. This password can contain any printable ASCII character except forward slash (/), double quote (\"), or the \"at\" symbol (@).</p> <p>Constraints: Must contain from 8 to 100 characters.</p>",
        "ModifyDBClusterMessage$PreferredBackupWindow": "<p>The daily time range during which automated backups are created if automated backups are enabled, using the <code>BackupRetentionPeriod</code> parameter. </p> <p>The default is a 30-minute window selected at random from an 8-hour block of time for each AWS Region. </p> <p>Constraints:</p> <ul> <li> <p>Must be in the format <code>hh24:mi-hh24:mi</code>.</p> </li> <li> <p>Must be in Universal Coordinated Time (UTC).</p> </li> <li> <p>Must not conflict with the preferred maintenance window.</p> </li> <li> <p>Must be at least 30 minutes.</p> </li> </ul>",
        "ModifyDBClusterMessage$PreferredMaintenanceWindow": "<p>The weekly time range during which system maintenance can occur, in Universal Coordinated Time (UTC).</p> <p>Format: <code>ddd:hh24:mi-ddd:hh24:mi</code> </p> <p>The default is a 30-minute window selected at random from an 8-hour block of time for each AWS Region, occurring on a random day of the week. </p> <p>Valid days: Mon, Tue, Wed, Thu, Fri, Sat, Sun</p> <p>Constraints: Minimum 30-minute window.</p>",
        "ModifyDBClusterMessage$EngineVersion": "<p>The version number of the database engine to which you want to upgrade. Changing this parameter results in an outage. The change is applied during the next maintenance window unless the <code>ApplyImmediately</code> parameter is set to <code>true</code>.</p>",
        "ModifyDBClusterParameterGroupMessage$DBClusterParameterGroupName": "<p>The name of the DB cluster parameter group to modify.</p>",
        "ModifyDBClusterSnapshotAttributeMessage$DBClusterSnapshotIdentifier": "<p>The identifier for the DB cluster snapshot to modify the attributes for.</p>",
        "ModifyDBClusterSnapshotAttributeMessage$AttributeName": "<p>The name of the DB cluster snapshot attribute to modify.</p> <p>To manage authorization for other AWS accounts to copy or restore a manual DB cluster snapshot, set this value to <code>restore</code>.</p>",
        "ModifyDBInstanceMessage$DBInstanceIdentifier": "<p>The DB instance identifier. This value is stored as a lowercase string.</p> <p>Constraints:</p> <ul> <li> <p>Must match the identifier of an existing <code>DBInstance</code>.</p> </li> </ul>",
        "ModifyDBInstanceMessage$DBInstanceClass": "<p>The new compute and memory capacity of the DB instance; for example, <code>db.r5.large</code>. Not all DB instance classes are available in all AWS Regions. </p> <p>If you modify the DB instance class, an outage occurs during the change. The change is applied during the next maintenance window, unless <code>ApplyImmediately</code> is specified as <code>true</code> for this request. </p> <p>Default: Uses existing setting.</p>",
        "ModifyDBInstanceMessage$PreferredMaintenanceWindow": "<p>The weekly time range (in UTC) during which system maintenance can occur, which might result in an outage. Changing this parameter doesn't result in an outage except in the following situation, and the change is asynchronously applied as soon as possible. If there are pending actions that cause a reboot, and the maintenance window is changed to include the current time, changing this parameter causes a reboot of the DB instance. If you are moving this window to the current time, there must be at least 30 minutes between the current time and end of the window to ensure that pending changes are applied.</p> <p>Default: Uses existing setting.</p> <p>Format: <code>ddd:hh24:mi-ddd:hh24:mi</code> </p> <p>Valid days: Mon, Tue, Wed, Thu, Fri, Sat, Sun</p> <p>Constraints: Must be at least 30 minutes.</p>",
        "ModifyDBInstanceMessage$NewDBInstanceIdentifier": "<p> The new DB instance identifier for the DB instance when renaming a DB instance. When you change the DB instance identifier, an instance reboot occurs immediately if you set <code>Apply Immediately</code> to <code>true</code>. It occurs during the next maintenance window if you set <code>Apply Immediately</code> to <code>false</code>. This value is stored as a lowercase string. </p> <p>Constraints:</p> <ul> <li> <p>Must contain from 1 to 63 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul> <p>Example: <code>mydbinstance</code> </p>",
        "ModifyDBInstanceMessage$CACertificateIdentifier": "<p>Indicates the certificate that needs to be associated with the instance.</p>",
        "ModifyDBSubnetGroupMessage$DBSubnetGroupName": "<p>The name for the DB subnet group. This value is stored as a lowercase string. You can't modify the default subnet group. </p> <p>Constraints: Must match the name of an existing <code>DBSubnetGroup</code>. Must not be default.</p> <p>Example: <code>mySubnetgroup</code> </p>",
        "ModifyDBSubnetGroupMessage$DBSubnetGroupDescription": "<p>The description for the DB subnet group.</p>",
        "OrderableDBInstanceOption$Engine": "<p>The engine type of a DB instance.</p>",
        "OrderableDBInstanceOption$EngineVersion": "<p>The engine version of a DB instance.</p>",
        "OrderableDBInstanceOption$DBInstanceClass": "<p>The DB instance class for a DB instance.</p>",
        "OrderableDBInstanceOption$LicenseModel": "<p>The license model for a DB instance.</p>",
        "OrderableDBInstanceOptionsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "Parameter$ParameterName": "<p>Specifies the name of the parameter.</p>",
        "Parameter$ParameterValue": "<p>Specifies the value of the parameter.</p>",
        "Parameter$Description": "<p>Provides a description of the parameter.</p>",
        "Parameter$Source": "<p>Indicates the source of the parameter value.</p>",
        "Parameter$ApplyType": "<p>Specifies the engine-specific parameters type.</p>",
        "Parameter$DataType": "<p>Specifies the valid data type for the parameter.</p>",
        "Parameter$AllowedValues": "<p>Specifies the valid range of values for the parameter.</p>",
        "Parameter$MinimumEngineVersion": "<p>The earliest engine version to which the parameter can apply.</p>",
        "PendingMaintenanceAction$Action": "<p>The type of pending maintenance action that is available for the resource.</p>",
        "PendingMaintenanceAction$OptInStatus": "<p>Indicates the type of opt-in request that has been received for the resource.</p>",
        "PendingMaintenanceAction$Description": "<p>A description providing more detail about the maintenance action.</p>",
        "PendingMaintenanceActionsMessage$Marker": "<p>An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by <code>MaxRecords</code>.</p>",
        "PendingModifiedValues$DBInstanceClass": "<p> Contains the new <code>DBInstanceClass</code> for the DB instance that will be applied or is currently being applied. </p>",
        "PendingModifiedValues$MasterUserPassword": "<p>Contains the pending or currently in-progress change of the master credentials for the DB instance.</p>",
        "PendingModifiedValues$EngineVersion": "<p>Indicates the database engine version.</p>",
        "PendingModifiedValues$LicenseModel": "<p>The license model for the DB instance.</p> <p>Valid values: <code>license-included</code>, <code>bring-your-own-license</code>, <code>general-public-license</code> </p>",
        "PendingModifiedValues$DBInstanceIdentifier": "<p> Contains the new <code>DBInstanceIdentifier</code> for the DB instance that will be applied or is currently being applied. </p>",
        "PendingModifiedValues$StorageType": "<p>Specifies the storage type to be associated with the DB instance.</p>",
        "PendingModifiedValues$CACertificateIdentifier": "<p>Specifies the identifier of the certificate authority (CA) certificate for the DB instance.</p>",
        "PendingModifiedValues$DBSubnetGroupName": "<p>The new DB subnet group for the DB instance. </p>",
        "RebootDBInstanceMessage$DBInstanceIdentifier": "<p>The DB instance identifier. This parameter is stored as a lowercase string.</p> <p>Constraints:</p> <ul> <li> <p>Must match the identifier of an existing <code>DBInstance</code>.</p> </li> </ul>",
        "RemoveTagsFromResourceMessage$ResourceName": "<p>The Amazon DocumentDB resource that the tags are removed from. This value is an Amazon Resource Name (ARN).</p>",
        "ResetDBClusterParameterGroupMessage$DBClusterParameterGroupName": "<p>The name of the DB cluster parameter group to reset.</p>",
        "ResourcePendingMaintenanceActions$ResourceIdentifier": "<p>The Amazon Resource Name (ARN) of the resource that has pending maintenance actions.</p>",
        "RestoreDBClusterFromSnapshotMessage$DBClusterIdentifier": "<p>The name of the DB cluster to create from the DB snapshot or DB cluster snapshot. This parameter isn't case sensitive.</p> <p>Constraints:</p> <ul> <li> <p>Must contain from 1 to 63 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul> <p>Example: <code>my-snapshot-id</code> </p>",
        "RestoreDBClusterFromSnapshotMessage$SnapshotIdentifier": "<p>The identifier for the DB snapshot or DB cluster snapshot to restore from.</p> <p>You can use either the name or the Amazon Resource Name (ARN) to specify a DB cluster snapshot. However, you can use only the ARN to specify a DB snapshot.</p> <p>Constraints:</p> <ul> <li> <p>Must match the identifier of an existing snapshot.</p> </li> </ul>",
        "RestoreDBClusterFromSnapshotMessage$Engine": "<p>The database engine to use for the new DB cluster.</p> <p>Default: The same as source.</p> <p>Constraint: Must be compatible with the engine of the source.</p>",
        "RestoreDBClusterFromSnapshotMessage$EngineVersion": "<p>The version of the database engine to use for the new DB cluster.</p>",
        "RestoreDBClusterFromSnapshotMessage$DBSubnetGroupName": "<p>The name of the DB subnet group to use for the new DB cluster.</p> <p>Constraints: If provided, must match the name of an existing <code>DBSubnetGroup</code>.</p> <p>Example: <code>mySubnetgroup</code> </p>",
        "RestoreDBClusterFromSnapshotMessage$KmsKeyId": "<p>The AWS KMS key identifier to use when restoring an encrypted DB cluster from a DB snapshot or DB cluster snapshot.</p> <p>The AWS KMS key identifier is the Amazon Resource Name (ARN) for the AWS KMS encryption key. If you are restoring a DB cluster with the same AWS account that owns the AWS KMS encryption key used to encrypt the new DB cluster, then you can use the AWS KMS key alias instead of the ARN for the AWS KMS encryption key.</p> <p>If you do not specify a value for the <code>KmsKeyId</code> parameter, then the following occurs:</p> <ul> <li> <p>If the DB snapshot or DB cluster snapshot in <code>SnapshotIdentifier</code> is encrypted, then the restored DB cluster is encrypted using the AWS KMS key that was used to encrypt the DB snapshot or the DB cluster snapshot.</p> </li> <li> <p>If the DB snapshot or the DB cluster snapshot in <code>SnapshotIdentifier</code> is not encrypted, then the restored DB cluster is not encrypted.</p> </li> </ul>",
        "RestoreDBClusterToPointInTimeMessage$DBClusterIdentifier": "<p>The name of the new DB cluster to be created.</p> <p>Constraints:</p> <ul> <li> <p>Must contain from 1 to 63 letters, numbers, or hyphens.</p> </li> <li> <p>The first character must be a letter.</p> </li> <li> <p>Cannot end with a hyphen or contain two consecutive hyphens.</p> </li> </ul>",
        "RestoreDBClusterToPointInTimeMessage$SourceDBClusterIdentifier": "<p>The identifier of the source DB cluster from which to restore.</p> <p>Constraints:</p> <ul> <li> <p>Must match the identifier of an existing <code>DBCluster</code>.</p> </li> </ul>",
        "RestoreDBClusterToPointInTimeMessage$DBSubnetGroupName": "<p>The DB subnet group name to use for the new DB cluster.</p> <p>Constraints: If provided, must match the name of an existing <code>DBSubnetGroup</code>.</p> <p>Example: <code>mySubnetgroup</code> </p>",
        "RestoreDBClusterToPointInTimeMessage$KmsKeyId": "<p>The AWS KMS key identifier to use when restoring an encrypted DB cluster from an encrypted DB cluster.</p> <p>The AWS KMS key identifier is the Amazon Resource Name (ARN) for the AWS KMS encryption key. If you are restoring a DB cluster with the same AWS account that owns the AWS KMS encryption key used to encrypt the new DB cluster, then you can use the AWS KMS key alias instead of the ARN for the AWS KMS encryption key.</p> <p>You can restore to a new DB cluster and encrypt the new DB cluster with an AWS KMS key that is different from the AWS KMS key used to encrypt the source DB cluster. The new DB cluster is encrypted with the AWS KMS key identified by the <code>KmsKeyId</code> parameter.</p> <p>If you do not specify a value for the <code>KmsKeyId</code> parameter, then the following occurs:</p> <ul> <li> <p>If the DB cluster is encrypted, then the restored DB cluster is encrypted using the AWS KMS key that was used to encrypt the source DB cluster.</p> </li> <li> <p>If the DB cluster is not encrypted, then the restored DB cluster is not encrypted.</p> </li> </ul> <p>If <code>DBClusterIdentifier</code> refers to a DB cluster that is not encrypted, then the restore request is rejected.</p>",
        "StartDBClusterMessage$DBClusterIdentifier": "<p>The identifier of the cluster to restart. Example: <code>docdb-2019-05-28-15-24-52</code> </p>",
        "StopDBClusterMessage$DBClusterIdentifier": "<p>The identifier of the cluster to stop. Example: <code>docdb-2019-05-28-15-24-52</code> </p>",
        "Subnet$SubnetIdentifier": "<p>Specifies the identifier of the subnet.</p>",
        "Subnet$SubnetStatus": "<p>Specifies the status of the subnet.</p>",
        "SubnetIdentifierList$member": null,
        "Tag$Key": "<p>The required name of the tag. The string value can be from 1 to 128 Unicode characters in length and can't be prefixed with \"aws:\" or \"rds:\". The string can contain only the set of Unicode letters, digits, white space, '_', '.', '/', '=', '+', '-' (Java regex: \"^([\\\\p{L}\\\\p{Z}\\\\p{N}_.:/=+\\\\-]*)$\").</p>",
        "Tag$Value": "<p>The optional value of the tag. The string value can be from 1 to 256 Unicode characters in length and can't be prefixed with \"aws:\" or \"rds:\". The string can contain only the set of Unicode letters, digits, white space, '_', '.', '/', '=', '+', '-' (Java regex: \"^([\\\\p{L}\\\\p{Z}\\\\p{N}_.:/=+\\\\-]*)$\").</p>",
        "UpgradeTarget$Engine": "<p>The name of the upgrade target database engine.</p>",
        "UpgradeTarget$EngineVersion": "<p>The version number of the upgrade target database engine.</p>",
        "UpgradeTarget$Description": "<p>The version of the database engine that a DB instance can be upgraded to.</p>",
        "VpcSecurityGroupIdList$member": null,
        "VpcSecurityGroupMembership$VpcSecurityGroupId": "<p>The name of the VPC security group.</p>",
        "VpcSecurityGroupMembership$Status": "<p>The status of the VPC security group.</p>"
      }
    },
    "Subnet": {
      "base": "<p> Detailed information about a subnet. </p>",
      "refs": {
        "SubnetList$member": null
      }
    },
    "SubnetAlreadyInUse": {
      "base": "<p>The DB subnet is already in use in the Availability Zone.</p>",
      "refs": {
      }
    },
    "SubnetIdentifierList": {
      "base": null,
      "refs": {
        "CreateDBSubnetGroupMessage$SubnetIds": "<p>The Amazon EC2 subnet IDs for the DB subnet group.</p>",
        "ModifyDBSubnetGroupMessage$SubnetIds": "<p>The Amazon EC2 subnet IDs for the DB subnet group.</p>"
      }
    },
    "SubnetList": {
      "base": null,
      "refs": {
        "DBSubnetGroup$Subnets": "<p>Detailed information about one or more subnets within a DB subnet group.</p>"
      }
    },
    "TStamp": {
      "base": null,
      "refs": {
        "Certificate$ValidFrom": "<p>The starting date-time from which the certificate is valid.</p> <p>Example: <code>2019-07-31T17:57:09Z</code> </p>",
        "Certificate$ValidTill": "<p>The date-time after which the certificate is no longer valid.</p> <p>Example: <code>2024-07-31T17:57:09Z</code> </p>",
        "DBCluster$EarliestRestorableTime": "<p>The earliest time to which a database can be restored with point-in-time restore.</p>",
        "DBCluster$LatestRestorableTime": "<p>Specifies the latest time to which a database can be restored with point-in-time restore.</p>",
        "DBCluster$ClusterCreateTime": "<p>Specifies the time when the DB cluster was created, in Universal Coordinated Time (UTC).</p>",
        "DBClusterSnapshot$SnapshotCreateTime": "<p>Provides the time when the snapshot was taken, in UTC.</p>",
        "DBClusterSnapshot$ClusterCreateTime": "<p>Specifies the time when the DB cluster was created, in Universal Coordinated Time (UTC).</p>",
        "DBInstance$InstanceCreateTime": "<p>Provides the date and time that the DB instance was created.</p>",
        "DBInstance$LatestRestorableTime": "<p>Specifies the latest time to which a database can be restored with point-in-time restore.</p>",
        "DescribeEventsMessage$StartTime": "<p> The beginning of the time interval to retrieve events for, specified in ISO 8601 format. </p> <p>Example: 2009-07-08T18:00Z</p>",
        "DescribeEventsMessage$EndTime": "<p> The end of the time interval for which to retrieve events, specified in ISO 8601 format. </p> <p>Example: 2009-07-08T18:00Z</p>",
        "Event$Date": "<p>Specifies the date and time of the event.</p>",
        "PendingMaintenanceAction$AutoAppliedAfterDate": "<p>The date of the maintenance window when the action is applied. The maintenance action is applied to the resource during its first maintenance window after this date. If this date is specified, any <code>next-maintenance</code> opt-in requests are ignored.</p>",
        "PendingMaintenanceAction$ForcedApplyDate": "<p>The date when the maintenance action is automatically applied. The maintenance action is applied to the resource on this date regardless of the maintenance window for the resource. If this date is specified, any <code>immediate</code> opt-in requests are ignored.</p>",
        "PendingMaintenanceAction$CurrentApplyDate": "<p>The effective date when the pending maintenance action is applied to the resource.</p>",
        "RestoreDBClusterToPointInTimeMessage$RestoreToTime": "<p>The date and time to restore the DB cluster to.</p> <p>Valid values: A time in Universal Coordinated Time (UTC) format.</p> <p>Constraints:</p> <ul> <li> <p>Must be before the latest restorable time for the DB instance.</p> </li> <li> <p>Must be specified if the <code>UseLatestRestorableTime</code> parameter is not provided.</p> </li> <li> <p>Cannot be specified if the <code>UseLatestRestorableTime</code> parameter is <code>true</code>.</p> </li> <li> <p>Cannot be specified if the <code>RestoreType</code> parameter is <code>copy-on-write</code>.</p> </li> </ul> <p>Example: <code>2015-03-07T23:45:00Z</code> </p>"
      }
    },
    "Tag": {
      "base": "<p>Metadata assigned to an Amazon DocumentDB resource consisting of a key-value pair.</p>",
      "refs": {
        "TagList$member": null
      }
    },
    "TagList": {
      "base": null,
      "refs": {
        "AddTagsToResourceMessage$Tags": "<p>The tags to be assigned to the Amazon DocumentDB resource. </p>",
        "CopyDBClusterParameterGroupMessage$Tags": "<p>The tags that are to be assigned to the parameter group.</p>",
        "CopyDBClusterSnapshotMessage$Tags": "<p>The tags to be assigned to the DB cluster snapshot.</p>",
        "CreateDBClusterMessage$Tags": "<p>The tags to be assigned to the DB cluster.</p>",
        "CreateDBClusterParameterGroupMessage$Tags": "<p>The tags to be assigned to the DB cluster parameter group.</p>",
        "CreateDBClusterSnapshotMessage$Tags": "<p>The tags to be assigned to the DB cluster snapshot.</p>",
        "CreateDBInstanceMessage$Tags": "<p>The tags to be assigned to the DB instance. You can assign up to 10 tags to an instance.</p>",
        "CreateDBSubnetGroupMessage$Tags": "<p>The tags to be assigned to the DB subnet group.</p>",
        "RestoreDBClusterFromSnapshotMessage$Tags": "<p>The tags to be assigned to the restored DB cluster.</p>",
        "RestoreDBClusterToPointInTimeMessage$Tags": "<p>The tags to be assigned to the restored DB cluster.</p>",
        "TagListMessage$TagList": "<p>A list of one or more tags.</p>"
      }
    },
    "TagListMessage": {
      "base": "<p>Represents the output of <a>ListTagsForResource</a>.</p>",
      "refs": {
      }
    },
    "UpgradeTarget": {
      "base": "<p>The version of the database engine that a DB instance can be upgraded to.</p>",
      "refs": {
        "ValidUpgradeTargetList$member": null
      }
    },
    "ValidUpgradeTargetList": {
      "base": null,
      "refs": {
        "DBEngineVersion$ValidUpgradeTarget": "<p>A list of engine versions that this database engine version can be upgraded to.</p>"
      }
    },
    "VpcSecurityGroupIdList": {
      "base": null,
      "refs": {
        "CreateDBClusterMessage$VpcSecurityGroupIds": "<p>A list of EC2 VPC security groups to associate with this DB cluster.</p>",
        "ModifyDBClusterMessage$VpcSecurityGroupIds": "<p>A list of virtual private cloud (VPC) security groups that the DB cluster will belong to.</p>",
        "RestoreDBClusterFromSnapshotMessage$VpcSecurityGroupIds": "<p>A list of virtual private cloud (VPC) security groups that the new DB cluster will belong to.</p>",
        "RestoreDBClusterToPointInTimeMessage$VpcSecurityGroupIds": "<p>A list of VPC security groups that the new DB cluster belongs to.</p>"
      }
    },
    "VpcSecurityGroupMembership": {
      "base": "<p>Used as a response element for queries on virtual private cloud (VPC) security group membership.</p>",
      "refs": {
        "VpcSecurityGroupMembershipList$member": null
      }
    },
    "VpcSecurityGroupMembershipList": {
      "base": null,
      "refs": {
        "DBCluster$VpcSecurityGroups": "<p>Provides a list of virtual private cloud (VPC) security groups that the DB cluster belongs to.</p>",
        "DBInstance$VpcSecurityGroups": "<p>Provides a list of VPC security group elements that the DB instance belongs to.</p>"
      }
    }
  }
}
